[
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 80,
    "guestName": "Stacey Mulcahy",
    "guestBio": [
      "Brian Friesen has been pretending to be a developer for the last 9 years and lives in constant fear of being found out. He suspects that someone has been bribing Microsoft on his behalf, as he has received the C# MVP award for the past three years. His presentations always involve live-coding and he prefers topics that don't get much attention. He lives near Detroit and works for an awesome company, Quicken Loans."
    ],
    "guestHeadshot": "/img/hwpod/stacey-mulcahy.jpg",
    "guestFirstMachineImage": "/img/hwpod/gateway.jpg",
    "guestFirstMachineName": "8088/86 XT Compatible/Clone",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/IBM_PC_compatible",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/iammerrick"
      },
      {
        "name": "Blog",
        "link": "http://merrickchristensen.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode80.mp3",
    "publishedDate": "11/21/16",
    "status": 0,
    "length": "00:00:00",
    "youTubeLink": ""
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 79,
    "guestName": "Jennifer Marsman",
    "guestBio": [
      "Jennifer Marsman is a Principal Developer Evangelist in Microsoft’s Developer and Platform Evangelism group, where she educates developers on Microsoft’s new technologies.  In this role, Jennifer is a frequent speaker at software development conferences around the world.  In 2016, Jennifer was recognized as one of the “top 100 most influential individuals in artificial intelligence and machine learning” by Onalytica.  She has been featured in Bloomberg for her work using EEG and machine learning to perform lie detection.  In 2009, Jennifer was chosen as \"Techie whose innovation will have the biggest impact\" by X-OLOGY for her work with GiveCamps, a weekend-long event where developers code for charity.  She has also received many honors from Microsoft, including the Central Region Top Contributor Award, Heartland District Top Contributor Award, DPE Community Evangelist Award, CPE Champion Award, MSUS Diversity & Inclusion Award, Gold Club, and Platinum Club.  Prior to becoming a Developer Evangelist, Jennifer was a software developer in Microsoft’s Natural Interactive Services division.  In this role, she earned two patents for her work in search and data mining algorithms.  Jennifer has also held positions with Ford Motor Company, National Instruments, and Soar Technology.  Jennifer holds a Bachelor’s Degree in Computer Engineering and Master’s Degree in Computer Science and Engineering from the University of Michigan in Ann Arbor.  Her graduate work specialized in artificial intelligence and computational theory.  Jennifer blogs at http://blogs.msdn.com/jennifer and tweets at http://twitter.com/jennifermarsman."
    ],
    "guestHeadshot": "/img/hwpod/jennifer-marsman.jpg",
    "guestFirstMachineImage": "/img/hwpod/gateway.jpg",
    "guestFirstMachineName": "Gateway PCs",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/Gateway,_Inc.",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/iammerrick"
      },
      {
        "name": "Blog",
        "link": "http://merrickchristensen.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode79.mp3",
    "publishedDate": "11/14/16",
    "status": 0,
    "length": "00:00:00",
    "youTubeLink": ""
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 78,
    "guestName": "Julie Yack",
    "guestBio": [
      "Brian Friesen has been pretending to be a developer for the last 9 years and lives in constant fear of being found out. He suspects that someone has been bribing Microsoft on his behalf, as he has received the C# MVP award for the past three years. His presentations always involve live-coding and he prefers topics that don't get much attention. He lives near Detroit and works for an awesome company, Quicken Loans."
    ],
    "guestHeadshot": "/img/hwpod/julie-yack.jpg",
    "guestFirstMachineImage": "/img/hwpod/gateway.jpg",
    "guestFirstMachineName": "Gateway PCs",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/Gateway,_Inc.",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/iammerrick"
      },
      {
        "name": "Blog",
        "link": "http://merrickchristensen.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode76.mp3",
    "publishedDate": "11/07/16",
    "status": 0,
    "length": "00:00:00",
    "youTubeLink": ""
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 77,
    "guestName": "Kevin Grossnicklaus",
    "guestBio": [
      "Over the past 15 years, Kevin Grossnicklaus has established himself as a go-to expert and a local and regional community leader for the software development industry. Prior to founding ArchitectNow in 2009, Kevin spent over a decade as the Chief Architect and Practice Leader for a large St. Louis IT firm. He also spent many years as an instructor at Washington University’s Center for the Application of Information Technology (CAIT) where he taught continuing education courses on a wide array of development technologies. Since 2009, Kevin has been recognized annually as a Microsoft Most Valuable Professional (MVP). This prestigious award puts Kevin in the company of just over 4,000 technology professionals worldwide and recognizes his commitment to technology and working to further the understanding of software development within the region.Kevin has been heavily involved in the Midwest development community and has traveled the world as a consultant and a trainer."
    ],
    "guestHeadshot": "/img/hwpod/Kevin-Grossnicklaus.jpg",
    "guestFirstMachineImage": "/img/hwpod/apple2e.jpg",
    "guestFirstMachineName": "Apple ][e",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Apple_IIe",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/kvgros"
      },
      {
        "name": "Blog",
        "link": "http://architectnow.net/blog/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode77.mp3",
    "publishedDate": "10/24/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": ""
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 76,
    "guestName": "David Giard",
    "guestBio": [
      "David Giard is a former accountant and a former biochemist, who has been developing solutions using Microsoft technologies for over 2 decades. Currently, David helps people build solutions in his role as a Microsoft Technical Evangelist. David has been very active in the developer community, speaking at numerous major conferences, code camps, and user groups around the world; helping to lead user groups; and helping to organize conferences and other geek events. He is the host and producer of the mildly popular online TV show Technology and Friends. He is the co-author of the Wrox book Real World .NET, C#, and Silverlight. You can read his latest thoughts at www.DavidGiard.com. His hobbies include video, photography, sports, and embarrassing his sons."
    ],
    "guestHeadshot": "/img/hwpod/david-giard.jpg",
    "guestFirstMachineImage": "/img/hwpod/gateway.jpg",
    "guestFirstMachineName": "Gateway PCs",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/Gateway,_Inc.",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/iammerrick"
      },
      {
        "name": "Blog",
        "link": "http://merrickchristensen.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode76.mp3",
    "publishedDate": "10/10/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": ""
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 75,
    "guestName": "Brian Friesen",
    "guestBio": [
      "Brian Friesen has been pretending to be a developer for the last 9 years and lives in constant fear of being found out. He suspects that someone has been bribing Microsoft on his behalf, as he has received the C# MVP award for the past three years. His presentations always involve live-coding and he prefers topics that don't get much attention. He lives near Detroit and works for an awesome company, Quicken Loans."
    ],
    "guestHeadshot": "/img/hwpod/brian-friesen.jpg",
    "guestFirstMachineImage": "/img/hwpod/pc-clone.jpg",
    "guestFirstMachineName": "PC Clone",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Pc_clone",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/brianfriesen"
      },
      {
        "name": "Blog",
        "link": "http://www.randomskunk.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode75.mp3",
    "publishedDate": "09/19/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": ""
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 74,
    "guestName": "Atley Hunter",
    "guestBio": [
      "Atley Hunter is a passionate developer with over 20 years’ experience. As one of the most prolific Modern UI developers in the world, he has hundreds of unique apps in the running on millions of Windows devices worldwide. A Microsoft Windows Platform MVP, and Telerik MVP & Insider, he is constantly working with developers worldwide to improve both skills and the platforms themselves. Atley is always sharing his knowledge and connecting with developers through events, his blog, email (devMentor@outlook.com), Twitter (@atleyhunter), Skype (Atley.Hunter) and LinkedIn."
    ],
    "guestHeadshot": "/img/hwpod/atley-hunter.jpg",
    "guestFirstMachineImage": "/img/hwpod/ibm-cardpunch.jpg",
    "guestFirstMachineName": "IBM Card Punch Machine",
    "guestFirstMachineLink": "http://www-03.ibm.com/ibm/history/exhibits/vintage/vintage_4506VV4002.html",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/atleyhunter"
      },
      {
        "name": "Blog",
        "link": "http://www.atleyhunter.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode74.mp3",
    "publishedDate": "09/12/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": ""
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 73,
    "guestName": "Mario Cardinal",
    "guestBio": [
      "A long-time agile coach specializing in software architecture, Mario Cardinal is the co-founder of Slingboards Lab, a productivity software publisher that help people achieve what is important in their day. An experimenter and an entrepreneur, he love to seize the opportunities that emerge from the unexpected. Since 2004, year after year, he received the Most Valuable Professional (MVP) award from Microsoft. MVP status is awarded to credible technology experts who are among the very best community members willing to share their experience to helping others realize their potential. An experienced Scrum practitioner, he has spent more than 20 years designing large-scale information systems. He is the author of the book \"Executable Specifications with Scrum\". His friends like to describe him as someone who can extract the essence of a complicated situation, sort out the core ideas from the incidental distractions and provide a summary that is easy to understand."
    ],
    "guestHeadshot": "/img/hwpod/mario-cardinal.jpg",
    "guestFirstMachineImage": "/img/hwpod/mainframe.jpg",
    "guestFirstMachineName": "Mainframe Computers",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/Mainframe_computer",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/mario_cardinal"
      },
      {
        "name": "Blog",
        "link": "http://mariocardinal.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode73.mp3",
    "publishedDate": "08/22/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": ""
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 72,
    "guestName": "Rob Hale",
    "guestBio": [
      "Rob Hale has over 20 years of software development experience creating solutions for a variety of industries including health and human services, ecommerce, and energy. He currently serves as a Principle Software Engineer at Renewable NRG Systems in Hinesburg, Vermont (http://www.renewablenrgsystems.com/). Rob has presented to user groups in the northeast and the occasional small conference.",
      "Building effective communities and teams is a passion of Rob's. He is co-founder of the Vermont Code Camp (http://www.vtcodecamp.org/), co-organizer of the Vermont Coders Connection (http://www.meetup.com/VTCode/), and co-organizer/emcee of HackVT (http://www.hackvt.com/) an annual hackathon in the state of Vermont.",
      "Rob is the proud father of two sons and husband to his wonderful wife. Follow him on Twitter at @rob_hale_vt"
    ],
    "guestHeadshot": "/img/hwpod/rob-hale.jpg",
    "guestFirstMachineImage": "/img/hwpod/c64.jpg",
    "guestFirstMachineName": "Commodore 64",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/commodore_64",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/rob_hale_vt"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode72.mp3",
    "publishedDate": "07/18/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/8svmkaDvtDM"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 71,
    "guestName": "Miguel de Icaza",
    "guestBio": [
      "Miguel de Icaza, co-founder and CTO of Ximian, is one of the foremost luminaries in the Linux development community and one of the world's most prominent advocates for Free Software. Before co-founding Ximian, Miguel was instrumental in the development of Linux for SPARC systems and the Midnight Commander file manager. Miguel is the founder and President of the GNOME Foundation. He was also the first recipient of the prestigious MIT Innovator of the Year award in 1999. Miguel has galvanized Ximian's efforts to make Linux accessible and available to the average computer user, and continues to reach out globally by working with international organizations such as eMexico to introduce affordable technology alternatives, like Linux, to other nations."
    ],
    "guestHeadshot": "/img/hwpod/miguel-de-icaza.jpg",
    "guestFirstMachineImage": "/img/hwpod/c64.jpg",
    "guestFirstMachineName": "Commodore 64",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/commodore_64",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/migueldeicaza"
      },
      {
        "name": "Blog",
        "link": "http://tirania.org/blog/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode71.mp3",
    "publishedDate": "07/11/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/gp5hoSdyIsQ"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 70,
    "guestName": "Nick Landry",
    "guestBio": [
      "Nick Landry (@ActiveNick) is a mobility pioneer and expert specializing in the design and production of mobile applications for consumers and the enterprise using diverse cross-platform technologies including Windows Phone, Windows 8, iOS, Android, Mobile Web, Xamarin and PhoneGap. Nick is a Senior Technical Evangelist with Microsoft in the New York Metro area and works with developers, students and IT pros to help them learn, adopt and use the Microsoft developer platform to design and build the next generation of apps for Windows Phone, Windows 8 and Windows Azure. Nick is also a Nokia Developer Ambassador whose mandate is to educate and support Windows Phone developers to maximize their success.",
      "Prior to joining Microsoft, Nick spent almost two years as a Senior Product Manager for mobile, data visualization and geospatial developer tools across multiple technologies and platforms. He previously spent most his career in IT consulting and services organizations across various technical and business roles, designing, building, managing and selling innovative software solutions for some of the world’s top brands and Fortune 500 companies."
    ],
    "guestHeadshot": "/img/hwpod/nick-landry.jpg",
    "guestFirstMachineImage": "/img/hwpod/vic20.jpg",
    "guestFirstMachineName": "Commodore Vic-20",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Commodore_VIC20",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/activenick"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode70.mp3",
    "publishedDate": "06/27/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/tvCNcaxez1E"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 69,
    "guestName": "John Petersen",
    "guestBio": [
      "John Petersen has been developing software for over 20 years. It all started when, as a staff accountant, he was asked to get involved in a system upgrade to replace an old IBM Series 1 computer (about the size of a large refrigerator!). Those first programs were written in Clipper in the summer of 1987. Since that time, tools he has used include dBase, FoxBase, Visual FoxPro, and Visual Basic.",
      "An early adopter of .NET, he then decided to go to law school. After practicing law for a few years, John realized that technology was a lot more interesting than the law. Today, John focuses on ASP.NET development and is having more fun than ever solving problems for clients.",
      "John is a Practice Director for Custom Application Development at Neudesic, a Microsoft Gold Partner and the Trusted Technology Partner in Business Innovation. A 9-time recipient of Microsoft’s Most Valuable Professional (MVP) Award, John is currently an ASP.NET/IIS MVP. John is also an ASP Insider and is the INETA Mentor for Pennsylvania and West Virginia. John is the author of several books and is a frequent contributor to Code Magazine and DevConnections Magazines. John holds a BS in Business Administration from Mansfield University, an MBA in Information Systems from St. Joseph’s University, and a JD from the Rutgers School of Law – Camden."
    ],
    "guestHeadshot": "/img/hwpod/john-petersen.jpg",
    "guestFirstMachineImage": "/img/hwpod/c64.jpg",
    "guestFirstMachineName": "Commodore 64",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/commodore_64",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/johnvpetersen"
      },
      {
        "name": "Neudesic",
        "link": "https://www.neudesic.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode69.mp3",
    "publishedDate": "06/20/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/U-OiPFt3RlU"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 68,
    "guestName": "G. Andrew Duthie",
    "guestBio": [
      "G. Andrew Duthie, aka devhammer, is the founder and chief consultant for Devhammer Enterprises. Andrew is a consultant focused on helping clients meet their business goals through software. Andrew is also a trainer and writer with nearly 20 years of industry experience, including nearly 10 years as a Technical Evangelist for Microsoft’s Mid-Atlantic States district, where he provided support and education for developers working with the Microsoft development platform. In addition to his work with Microsoft, Andrew is the author of several books on ASP.NET and web development, and has spoken at numerous industry conferences from VSLive! and ASP.NET Connections, to Microsoft’s Professional Developer Conference (PDC) and Tech-Ed. Andrew has been an active participant and speaker in the Washington, DC area user group community since way back in 1997, when one of his co-workers dragged him out to the Internet Developers User Group in Tyson’s Corner, VA, and he’s been hooked ever since."
    ],
    "guestHeadshot": "/img/hwpod/g-andrew-duthie.jpg",
    "guestFirstMachineImage": "/img/hwpod/commodore-pet.jpg",
    "guestFirstMachineName": "Commodore PET",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Commodore_PET",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/devhammer"
      },
      {
        "name": "DevHammer Enterprises",
        "link": "http://devhammer.net/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode68.mp3",
    "publishedDate": "06/13/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/DvM_B8xHEU8"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 67,
    "guestName": "Rui Carvalho",
    "guestBio": [
      "Rui is a software craftsman mostly working on Microsoft and web areas since 20 years, from the early Asp 2.0 to the latest DNX stuff. After a long time acting as a consultant for big companies, he focuses today on developing, teaching and mentoring teams on smaller projects like startups to build the right products with simplicity. He use to speak at different conferences about .net web, agility and developer’s practices, he also advocates for open source and open minds in the .net community and that’s why he leads today the alt.net group in France. Since 2014, he organize a professional developer’s conference in Paris, NCrafts with strong focus on new technologies, great practices and design and more globally about crafting software with love."
    ],
    "guestHeadshot": "/img/hwpod/Rui-Carvalho.jpg",
    "guestFirstMachineImage": "/img/hwpod/thompson-to7.jpg",
    "guestFirstMachineName": "Thompson TO7",
    "guestFirstMachineLink": "http://www.old-computers.com/museum/computer.asp?c=11",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/rhwy"
      },
      {
        "name": "Blog",
        "link": "http://rui.io/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode67.mp3",
    "publishedDate": "05/31/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/aBb2eOtHdtk"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 66,
    "guestName": "Bill Wagner",
    "guestBio": [
      "Bill Wagner is one of the world’s foremost C# developers and a member of the ECMA C# Standards Committee. He is President of the Humanitarian Toolbox, has been awarded Microsoft Regional Director and .NET MVP for 10+years, and was recently appointed to the .NET Foundation Advisory Board. Wagner currently works with companies ranging from start-ups to enterprises improving the software development process and growing their software development teams.",
      "As a thought leader on C# programming language, Bill Wagner has authored 2 books; a best seller, “Effective C#”, and “More Effective C#”. Bill authors video training through Microsoft Virtual Academy on C# and .NET development. B ill has also written hundreds of technical articles (MSDN Magazine, .NET Developers Journal, Visual Studio Magazine, and many others), as well as actively blogs at http://www.thebillwagner.com/."
    ],
    "guestHeadshot": "/img/hwpod/bill-wagner.jpg",
    "guestFirstMachineImage": "/img/hwpod/ohioscientific.jpg",
    "guestFirstMachineName": "Ohio Scientific",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/Ohio_Scientific",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/billwagner"
      },
      {
        "name": "Blog",
        "link": "http://www.thebillwagner.com/blo6"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode66.mp3",
    "publishedDate": "05/16/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/fuaasTwCtLw"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 65,
    "guestName": "Merrick Christensen",
    "guestBio": [
      "Merrick Christensen has been programming for ten years and nearly all of that time has been focused in the web space. He’s built many high-traffic projects for prolific companies such as National Geographic, ABC Disney, Fox and others. He co-organized ng-conf, the official Angular conference. Was a panelist on the JavaScript Jabber podcast. Spoken at many conferences and maintained even more open source projects. The last five years he has been working at Domo trying to change the way people do business."
    ],
    "guestHeadshot": "/img/hwpod/Merrick-Christensen.jpg",
    "guestFirstMachineImage": "/img/hwpod/gateway.jpg",
    "guestFirstMachineName": "Gateway PCs",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/Gateway,_Inc.",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/iammerrick"
      },
      {
        "name": "Blog",
        "link": "http://merrickchristensen.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode65.mp3",
    "publishedDate": "04/25/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/gXhFJMD2twQ"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 64,
    "guestName": "Richard Hundhausen",
    "guestBio": [
      "Richard is the president of Accentient, a company that helps software teams develop better products by leveraging ALM tools and Scrum. He is a Professional Scrum Trainer, author of Professional Scrum Development with Microsoft Visual Studio, and co-creator of the Scaled Professional Scrum framework. As a software developer and consultant with over 30 years of experience, he understands that software is built and delivered by people and not by processes or tools."
    ],
    "guestHeadshot": "/img/hwpod/Richard-Hundhausen.jpg",
    "guestFirstMachineImage": "/img/hwpod/trs80-m1.jpg",
    "guestFirstMachineName": "TRS-80 Model 1",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/TRS-80",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "http://twitter.com/rhundhausen"
      },
      {
        "name": "Blog",
        "link": "http://blog.accentient.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode64.mp3",
    "publishedDate": "04/18/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/sSC1XCUtcVQ"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 63,
    "guestName": "Scott Guthrie",
    "guestBio": [
      "As executive vice president of the Microsoft Cloud and Enterprise group, Scott Guthrie is responsible for the company’s cloud infrastructure, server, database, management and development tools businesses. His engineering team builds Microsoft Azure, Windows Server, SQL Server, Active Directory, System Center, Visual Studio and .NET.",
      "Prior to leading the Cloud and Enterprise group, Guthrie helped lead Microsoft Azure, Microsoft’s public cloud platform. Since joining the company in 1997, he has made critical contributions to many of Microsoft’s key cloud, server and development technologies and was one of the original founders of the .NET project. Guthrie graduated with a bachelor’s degree in computer science from Duke University. He lives in Seattle with his wife and two children."
    ],
    "guestHeadshot": "/img/hwpod/scott-guthrie.jpg",
    "guestFirstMachineImage": "/img/hwpod/ibm-pc.jpg",
    "guestFirstMachineName": "IBM PC",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/IBM_Personal_Computer",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "http://twitter.com/scottgu"
      },
      {
        "name": "Blog",
        "link": "https://weblogs.asp.net/scottgu"
      },
      {
        "name": "Microsoft Azure",
        "link": "http://azure.microsoft.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode63.mp3",
    "publishedDate": "04/11/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/nVE7yp_yeBU"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 62,
    "guestName": "Beth Massi",
    "guestBio": [
      "Beth is a Senior Product Manager for .NET at Microsoft and a long-time community champion for .NET developers. She helps developers build amazing things. Before Microsoft, she spent many years building business apps for small businesses as well as large enterprises, primarily on the .NET stack, and was a Microsoft MVP. She is a speaker at various software development events and you can find her on a variety of developer sites. Follow her on twitter and GitHub: @BethMassi"
    ],
    "guestHeadshot": "/img/hwpod/beth-massi.jpg",
    "guestFirstMachineImage": "/img/hwpod/atari400.jpg",
    "guestFirstMachineName": "Atari 400",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/Atari_8-bit_family#The_early_machines:_400_and_800",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "http://twitter.com/bethmassi"
      },
      {
        "name": "GitHub",
        "link": "http://github.com/bethmassi"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode62.mp3",
    "publishedDate": "04/04/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/Rn40N7q-6AI"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 61,
    "guestName": "Tim Huckaby",
    "guestBio": [
      "Tim Huckaby is an industry luminary focused on Emerging User Experiences, User Interaction Design and the Natural User Interface (NUI). Mr. Huckaby has been awarded many times for the highest rated keynotes & presentations for Microsoft and many other industry & technology conferences like CES and events world-wide. Mr. Huckaby is consistently rated in the top 10% of all speakers at these events. Having worked for or with Microsoft for over 25 years, Mr. Huckaby has been on stage with, and done numerous keynote demos for many Microsoft executives including Bill Gates and Steve Ballmer."
    ],
    "guestHeadshot": "/img/hwpod/tim-huckaby.jpg",
    "guestFirstMachineImage": "/img/hwpod/mainframe.jpg",
    "guestFirstMachineName": "Mainframe Computers",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/Mainframe_computer",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "http://twitter.com/timhuckaby"
      },
      {
        "name": "Blog",
        "link": "http://blogs.interknowlogy.com/author/timhuckaby/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode61.mp3",
    "publishedDate": "03/21/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/ynLSt78h2is"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 60,
    "guestName": "Rod Paddock",
    "guestBio": [
      "Rod Paddock is the editor of CODE Magazine. Rod has been a software developer for more than 10 years and has worked with tools like Visual Studio .NET SQL Server, Visual Basic, Visual FoxPro, Delphi and numerous others. Rod is president of Dash Point Software, Inc. Dash Point is an award winning software development firm that specializes in developing applications for small to large businesses. Dash Point has delivered applications for numerous corporations like: Six Flags, First Premier Bank, Intel, Microsoft and the US Coast Guard. Rod is also VP of Development for SQL Server tools maker, Red Matrix Technologies. (www.redmatrix.com)."
    ],
    "guestHeadshot": "/img/hwpod/rod-paddock.jpg",
    "guestFirstMachineImage": "/img/hwpod/apple2e.jpg",
    "guestFirstMachineName": "Apple ][e",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Apple_IIe",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/rodpaddock"
      },
      {
        "name": "Editor for CODE Magazine",
        "link": "http://www.codemag.com/People/Bio/Rod.Paddock"
      },
      {
        "name": "Blog",
        "link": "https://lostechies.com/rodpaddock/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode60.mp3",
    "publishedDate": "03/14/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/HmFwtMyTrpU"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 59,
    "guestName": "Todd Miranda",
    "guestBio": [
      "Todd Miranda is a consultant, trainer, and author. He has been developing on various platforms for over 20 years and has been involved with .NET since it was first released in 2000. He has worked with many of the .NET platforms but focuses primarily on ASP.NET. He is the owner of NxtDimension Solutions and provides consulting and training on the Microsoft stack. Todd has been awarded a Microsoft MVP for the last 7 years. He is the co-founder of the Birmingham .NET User Group and remains active in the development community. He has recorded hundreds of online training videos on Microsoft development topics including security, JavaScript, Silverlight, WPF, Expression and ASP.NET. He is an INETA speaker and regularly presents at user groups, community events, and technical conferences."
    ],
    "guestHeadshot": "/img/hwpod/todd-miranda.jpg",
    "guestFirstMachineImage": "/img/hwpod/c64.jpg",
    "guestFirstMachineName": "Commodore 64",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/commodore_64",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "http://twitter.com/toddmiranda"
      },
      {
        "name": "Nxt Dimension Solutions",
        "link": "http://www.nxtdimension.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode59.mp3",
    "publishedDate": "03/07/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/AePsZF9AAFk"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 58,
    "guestName": "Jim Wooley",
    "guestBio": [
      "By day, Jim Wooley is a consultant for Slalom Consulting, In his free time, Jim is a frequent speaker, INETA Regional Speaker, MVP, and author of \"LINQ in Action\". He is always striving to stay at the forefront of technology and enjoys the thrill of a new challenge. He has been active evangelizing LINQ since it's announcement in 2005. In addition, he attempts to pass on the insights he has gained by being active in the community, including organizing and speaking at code camps and regional events, including DevLink, DevWeek, CodeMash, CodeStock, VS Live, and MIX."
    ],
    "guestHeadshot": "/img/hwpod/jim-wooley.jpg",
    "guestFirstMachineImage": "/img/hwpod/mainframe.jpg",
    "guestFirstMachineName": "Mainframe Computers",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/Mainframe_computer",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "http://twitter.com/jimwooley"
      },
      {
        "name": "Blog",
        "link": "http://www.thinqlinq.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode58.mp3",
    "publishedDate": "02/29/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://www.youtube.com/watch?v=6Ug42XGdAiE"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 57,
    "guestName": "Billy Hollis",
    "guestBio": [
      "Billy is internationally known for his work on user experience design and native software development. His team, based in Nashville, Tennessee, has created modern apps hailed around the world for innovation and effective use of advanced user interface technologies. Billy offers training on user experience design for any platform, and technical classes on XAML technologies, including the Universal Windows Platform. You can see Billy at major conferences all over the world, usually doing sessions to help developers to become more focused on designing and developing software that users love."
    ],
    "guestHeadshot": "/img/hwpod/billy-hollis.jpg",
    "guestFirstMachineImage": "/img/hwpod/ibm-cardpunch.jpg",
    "guestFirstMachineName": "IBM Card Punch Machine",
    "guestFirstMachineLink": "http://www-03.ibm.com/ibm/history/exhibits/vintage/vintage_4506VV4002.html",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "http://twitter.com/billyhollis"
      },
      {
        "name": "Blog",
        "link": "http://nextver.com/site/blog/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode57.mp3",
    "publishedDate": "01/11/16",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/U8ExXjrkgS0"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 56,
    "guestName": "Peter Ritchie",
    "guestBio": [
      "Currently Software Architect at Quicken Loans, Peter has over 12 years' experience working with .NET applications in C#. Prior to focusing on C#, Peter worked primarily in C/C++, which accounts for the majority of his 26 years of programming and design experience. Peter works with a variety of applications and systems including WinForms/WPF applications, client server applications, distributed applications, and web applications. Components include Windows services, TCP servers, TCP clients, HTTP server, and HTTP clients. Peter has also worked with a variety of middleware products including RabbitMQ and MSMQ.",
      "Peter has spoken internationally on a variety of topics including unit test design and management, asynchronous programming, advanced .NET language features and syntax, concurrent and parallel programming and distributed programming.  Peter is the author of Refactoring with Visual Studio 2010 and Visual Studio 2010 Best Practices."
    ],
    "guestHeadshot": "/img/hwpod/peter-ritchie.jpg",
    "guestFirstMachineImage": "/img/hwpod/apple2.jpg",
    "guestFirstMachineName": "Apple ][",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Apple_II",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "http://twitter.com/peterritchie"
      },
      {
        "name": "Blog",
        "link": "http://blog.peterritchie.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode56.mp3",
    "publishedDate": "11/30/15",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://youtu.be/LzXKuIVpVPs"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 55,
    "guestName": "Rick Strahl",
    "guestBio": [
      "Rick Strahl is the Big Kahuna and janitor at West Wind Technologies located on the beautiful island of Maui, Hawaii. Between windsurf sessions and spikey haired adventures, Rick has been a software developer for over 25 years, developing business and Web applications since the very early days of the Web when you needed a hand crank (or a pair of wire splicers) to get online. Today Rick builds client centric Web applications and services for customers with HTML5, JavaScript and mobile Web technologies, using AngularJS on the front end, and  the ASP.NET stack on the back end. Rick’s company West Wind Technologies also produces a number of developer related tools including West Wind WebSurge, West Wind Web Monitor and Html Help Builder.  He also maintains a host of open source libraries at  http://github.com/RickStrahl and you can find Rick’s blog at weblog.west-wind.com or contact him directly at rstrahl@west-wind.com."
    ],
    "guestHeadshot": "/img/hwpod/rick-strahl.jpg",
    "guestFirstMachineImage": "/img/hwpod/apple2e.jpg",
    "guestFirstMachineName": "Apple ][e",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Apple_IIe",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/rickstrahl"
      },
      {
        "name": "His Band",
        "link": "https://en.wikipedia.org/wiki/Attitude_Adjustment"
      },
      {
        "name": "Rick with Long Hair",
        "link": "http://americanparanoia.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode55.mp3",
    "publishedDate": "08/31/15",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/2lhlcY5VK_4"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 54,
    "guestName": "Jeff Handley",
    "guestBio": [
      "Jeff Handley works at Concur and is focusing on the UI for web applications. He previously worked at Microsoft as the Development Lead for NuGet and WCF RIA Services. Jeff has been building and maturing software projects for 20 years. His largest projects have covered education, healthcare waste management, fantasy football, credit/mortgage, and point of sale. Throughout his career, he keeps getting drawn back to web application development."
    ],
    "guestHeadshot": "/img/hwpod/jeff-handley.jpg",
    "guestFirstMachineImage": "/img/hwpod/ibm-ps2.jpg",
    "guestFirstMachineName": "IBM PS/2",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/IBM_Personal_System/2",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/jeffhandley"
      },
      {
        "name": "Blog",
        "link": "http://jeffhandley.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode54.mp3",
    "publishedDate": "08/17/15",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/D3U7lxMfqg8"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 53,
    "guestName": "Barry Dorrans",
    "guestBio": [
      "Barry is the security czar for ASP.NET which means he gets to look at the framework, tools and template code, searching for potential insecurities and sometimes even fixing them. He also triages publically and privately reported vulnerabilities before getting someone else to fix them which means he gets all of the fun and none of the responsibility. He is rude and objectionable on twitter as @blowdart."
    ],
    "guestHeadshot": "/img/hwpod/barry-dorrans.jpg",
    "guestFirstMachineImage": "/img/hwpod/zx-spectrum.jpg",
    "guestFirstMachineName": "Sinclair ZX Spectrum",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/ZX_Spectrum",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/blowdart"
      },
      {
        "name": "BBC Microbit Device",
        "link": "https://news.microsoft.com/en-gb/2015/07/07/microsoft-and-the-bbc-microbit-a-million-ways-to-inspire-a-generation/"
      },
      {
        "name": "Microsoft Research BBC Microbit Device Page",
        "link": "http://research.microsoft.com/microbit/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode53.mp3",
    "publishedDate": "07/27/15",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/ycl1Y3d-MW4"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 52,
    "guestName": "Matt Pietrek",
    "guestBio": [
      "With over 25 years in the software industry, Matt Pietrek has had quite the interesting ride. Starting at Borland in the late 1980s during the heady days of the Microsoft/Borland “compilers wars”, he got his first, intoxicating taste of OS internals, debuggers and tools. From there he spent a decade at NuMega Technologies, working on seminal, award-winning products like BoundsChecker and SoftIce. Next was a seven year stint at Microsoft where he worked on the Visual Studio debugger & profiler teams, Red Dog (now known as Azure), and Hyper-V. He currently works at Skytap, a cloud computing company. Along the way, he wrote several books on Windows internals, as well as numerous articles and columns for magazines just as MSJ/MSDN, PC Magazine, and Byte. When not slinging Python code or groveling through logs, Matt indulges his passion for distilled spirits and cocktails. He’s got a serious, ever growing collection of rums, and writes the CocktailWonk blog about his spirited adventures: http://cocktailwonk.com"
    ],
    "guestHeadshot": "/img/hwpod/matt-pietrek.jpg",
    "guestFirstMachineImage": "/img/hwpod/ti99.jpg",
    "guestFirstMachineName": "TI-99",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Ti-99",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.wheaty.net/"
      },
      {
        "name": "Cocktail Wonk",
        "link": "http://cocktailwonk.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode52.mp3",
    "publishedDate": "04/02/15",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/NbzlDsG13Ts"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 51,
    "guestName": "Frans Bouma",
    "guestBio": [
      "Frans Bouma is the creator and lead developer of LLBLGen Pro, a leading ORM and Entity Modeling solution for .NET. Programming professionally since '94, after he (finally) got his B.sc in Computer Science. Frans wrote his first code back in '86 on a Toshiba HX-10 MSX computer and has been fascinated about telling computer hardware to do what you want by writing software ever since. In his spare time he spent more than a decade in the underground scene called 'Demoscene', first on Commodore Amiga 500 and later on PC, writing graphical demos and computer music. "
    ],
    "guestHeadshot": "/img/hwpod/frans-bouma.jpg",
    "guestFirstMachineImage": "/img/hwpod/toshiba-msx-hx10.jpg",
    "guestFirstMachineName": "Toshiba HX-10 MSX",
    "guestFirstMachineLink": "http://www.msx.org/wiki/Toshiba_HX-10",
    "guestLinks": [
      {
        "name": "LLBLGen Pro",
        "link": "http://www.llblgen.com"
      },
      {
        "name": "Blog",
        "link": "http://weblogs.asp.net/fbouma"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/FransBouma"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode51.mp3",
    "publishedDate": "02/24/15",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/Hf0yvzeKDNY"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 50,
    "guestName": "Keith Elder",
    "guestBio": [
      "Keith Elder is the co-host of the popular online technology podcast Deep Fried Bytes. He is also a Director of Software Engineering at Quicken Loans, the nation’s largest online mortgage lender based in Detroit, MI. Keith is an experienced technologist, systems administrator, software engineer, speaker, trainer and all around geek. He speaks throughout the United States at major technical conferences, Code Camps, and .Net User Groups. Keith’s ability to explain complex topics with a friendly common sense southern attitude make him a highly regarded speaker at technical conferences. You can read more about Keith’s interests, hobbies, rants and raves on his blog at http://keithelder.net/ and follow him on twitter at http://twitter.com/keithelder."
    ],
    "guestHeadshot": "/img/hwpod/keith-elder.jpg",
    "guestFirstMachineImage": "/img/hwpod/timexsinclair1000.jpg",
    "guestFirstMachineName": "Timex Sinclair 1000",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Timex_Sinclair_1000",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://keithelder.net/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/keithelder"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode050.mp3",
    "publishedDate": "02/01/15",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/l7_TGkB4MBk"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 49,
    "guestName": "Scott Stanfield",
    "guestBio": [
      "Scott Stanfield is the founder and CEO of Vertigo Software, Inc., a digital design and development shop for the media & entertainment business. He is a frequent public speaker, presenting on software technology and design for the past 20 years. Vertigo is making TV Everywhere happen for the major US broadcasters on mobile, desktop and consoles.",
      "Before starting Vertigo in 1997, Scott worked at Pixar in Point Richmond, California, which happens to be the current home of Vertigo. Scott holds a BS in Computer Science for Cal Poly, San Luis Obispo. Follow Scott on Twitter at @seesharp or email to scott@vertigo.com."
    ],
    "guestHeadshot": "/img/hwpod/scott-stanfield.jpg",
    "guestFirstMachineImage": "/img/hwpod/atari800.jpg",
    "guestFirstMachineName": "Atari 800",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Atari_8-bit_family",
    "guestLinks": [
      {
        "name": "Vertigo",
        "link": "http://vertigo.com/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/seesharp"
      },
      {
        "name": "Typography for Lawyers",
        "link": "http://typographyforlawyers.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode049.mp3",
    "publishedDate": "01/15/15",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/F4iN55bPYh8"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 48,
    "guestName": "Dave Ward",
    "guestBio": [
      "Dave Ward is an independent consultant and author, specializing in projects ranging from ASP.NET, to Node.js, to JavaScript single page applications, to hybrid mobile apps. With twenty years of experience developing for the web, he has been recognized as a Microsoft Regional Director, ASP.NET MVP, and member of the ASPInsiders. To learn more or to get in touch with Dave, you can visit his blog at http://Encosia.com or find him on Twitter as @Encosia."
    ],
    "guestHeadshot": "/img/hwpod/Dave-Ward.jpg",
    "guestFirstMachineImage": "/img/hwpod/trs80coco.jpg",
    "guestFirstMachineName": "TRS-80 Color Computer",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/TRS-80_Color_Computer",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://encosia.com/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/encosia"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode48.mp3",
    "publishedDate": "01/01/15",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/jRqUlThXQDU"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 47,
    "guestName": "Steve Smith",
    "guestBio": [
      "Steve is an entrepreneur and software developer with a passion for building quality software as effectively as possible. He is currently the Chief Technology Officer of Falafel Software. Steve has published several courses on Pluralsight, covering DDD, SOLID, design patterns, and software architecture. He's a Microsoft Regional Director and MVP, a frequent speaker at developer conferences, an author, and a trainer. Along with his wife and business partner, Michelle Smith, Steve was also the founder of Lake Quincy Media (acquired by The Code Project) and NimblePros (acquired by Telerik). Steve's an ex-Army Engineer officer and Iraq veteran who enjoys playing games and spending time outdoors."
    ],
    "guestHeadshot": "/img/hwpod/steve-smith.jpg",
    "guestFirstMachineImage": "/img/hwpod/apple2plus.jpg",
    "guestFirstMachineName": "Apple II+",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Apple_II_Plus",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://ardalis.com/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/ardalis"
      },
      {
        "name": "Pluralsight Author",
        "link": "http://pluralsight.com/training/Authors/Details/steve-smith"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode47.mp3",
    "publishedDate": "12/15/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/urca02GlFes"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 46,
    "guestName": "Rockford Lhotka",
    "guestBio": [
      "Rockford Lhotka is the CTO of Magenic, and is the creator of the widely used CSLA .NET development framework. He is the author of numerous books, and regularly speaks at major conferences around the world. Rockford is a Microsoft Regional Director and MVP. Magenic (www.magenic.com) is a company that specializes in planning, designing, building and maintaining your enterprise’s most mission critical systems. For more information go to www.lhotka.net."
    ],
    "guestHeadshot": "/img/hwpod/rocky-lhotka.jpg",
    "guestFirstMachineImage": "/img/hwpod/cyber-mainframe.jpg",
    "guestFirstMachineName": "Cyber Mainframe",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/CDC_Cyber",
    "guestLinks": [
      {
        "name": "Rocky's Website",
        "link": "http://www.lhotka.net"
      },
      {
        "name": "Blog",
        "link": "http://www.lhotka.net/weblog"
      },
      {
        "name": "CLSA.NET",
        "link": "http://www.cslanet.com"
      },
      {
        "name": "Magenic",
        "link": "http://www.magenic.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode46.mp3",
    "publishedDate": "11/01/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/t7Y8llomViA"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 45,
    "guestName": "Deborah Kurata",
    "guestBio": [
      "Deborah Kurata is an independent software consultant/developer specializing in Web and .NET development using AngularJS, VB.NET, and C#. She is also a Pluralsight author with seven courses to her name.",
      "Deborah has authored several programming books including the popular \"Doing Objects\" series and is a speaker at conferences such as VSLive! and TechEd. She is also the co-chair of the EastBay.NET user group in the San Francisco Bay/Silicon Valley area."
    ],
    "guestHeadshot": "/img/hwpod/deborah-kurata.jpg",
    "guestFirstMachineImage": "/img/hwpod/mac-128k.jpg",
    "guestFirstMachineName": "Macintosh 128K",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Macintosh_128K",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.bit.ly/DeborahKsBlog"
      },
      {
        "name": "Pluralsight Author",
        "link": "http://pluralsight.com/training/Authors/Details/deborah-kurata"
      },
      {
        "name": "'AngularJS Line of Business Applications' Course",
        "link": "http://www.pluralsight.com/courses/angularjs-line-of-business-applications"
      },
      {
        "name": "'Object-Oriented Programming Fundamentals in C#' Course",
        "link": "http://www.pluralsight.com/courses/object-oriented-programming-fundamentals-csharp"
      },
      {
        "name": "'Defensive Coding in C#' Course",
        "link": "http://www.pluralsight.com/courses/defensive-coding-csharp"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode45.mp3",
    "publishedDate": "10/20/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/4RNJfw1M5WA"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 44,
    "guestName": "Steve Evans",
    "guestBio": [
      "Steve Evans has been doing DevOps since before the term DevOps was invented. He is a Pluralsight Author, five time Microsoft Most Valuable Professional (MVP), and technical Speaker at various industry events. In his spare time he manages a DevOps team at a Silicon Valley Biotech focused on improving the lives of cancer patients. For over 15 years Steve has focused on making technology better for businesses by bridging the gap between IT and Development teams.",
      "You can follow his technical blog at http://www.LoudSteve.com or find him on twitter at@TheLoudSteve."
    ],
    "guestHeadshot": "/img/hwpod/Steve-Evans.jpg",
    "guestFirstMachineImage": "/img/hwpod/kaypro.jpg",
    "guestFirstMachineName": "Kaypro",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Kaypro",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.LoudSteve.com"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/TheLoudSteve"
      },
      {
        "name": "Pluralsight Author",
        "link": "http://www.pluralsight.com/training/Authors/Details?handle=steve-evans"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode44.mp3",
    "publishedDate": "10/13/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/5XH3yNrNaNM"
  },
  {
    "blurb": [
      "From professional musician to software developer, that's Walt Ritscher's story. In this episode, Walt and I discuss the migration from keyboards and sequencers to DirectX pixel shaders. It's a bumpy ride that has resulted in Walt's reknown knowledge of UI development."
    ],
    "episodeNumber": 43,
    "guestName": "Walt Ritscher",
    "guestBio": [
      "Walt's enthusiasm for crafting software interfaces blossomed early.  Just a few days after discovering how to make pixels move around the screen of a borrowed computer he was devouring books on the topic of computer graphics and UI design.  Now he travels the world speaking at software conferences and teaching a diverse portfolio of programming topics for corporate clients. On the consulting side he continues to work with customers like Microsoft, HP, Intel, and Intuit and enjoys being part of the Wintellect consultant group. He has over fifty hours of video training courses available in the WintellectNow, Lynda and Udemy catalogs. He writes for several publications including Code Magazine and has a new \"HLSL and Pixel Shaders for XAML Developer\" book available from O'Reilly Media. His current UI obsession revolves around the Windows 8 Metro, Mobile, ASP.NET MVC and WPF APIs.  This year he is learning as much as he can about Xamarin. You can find his blog at xamlwonderland.com. Walt is also a Microsoft MVP and author of the free Shazzam Shader Editor (shazzam-tool.com).",
      "He is also deeply involved in the local developer community — founding the .NET Developers Association in Redmond, WA and continues to help organize the Seattle Code Camp, developer hackathons and other local events."
    ],
    "guestHeadshot": "/img/hwpod/walt-ritscher.jpg",
    "guestFirstMachineImage": "/img/hwpod/apple2gs.jpg",
    "guestFirstMachineName": "Apple IIGS",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Apple_II_series#Apple_IIGS",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://xamlwonderland.com"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/waltritscher"
      },
      {
        "name": "LinkedIn",
        "link": "http://www.linkedin.com/in/waltritscher"
      },
      {
        "name": "Lynda Courses",
        "link": "http://Lynda.com/waltritscher"
      },
      {
        "name": "Wintellect Now Courses",
        "link": "https://www.wintellectnow.com/Instructor/Bio/WaltRitscher"
      },
      {
        "name": "Shazzam Tool",
        "link": "http://shazzam-tool.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode43.mp3",
    "publishedDate": "10/06/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/-UQ48W0dk78"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 42,
    "guestName": "Kate Gregory",
    "guestBio": [
      "Kate Gregory has been using C++ since before Microsoft had a C++ compiler, and has been paid to program since 1979. She loves C++ and believes that software should make our lives easier. That includes making the lives of developers easier! She'll stay up late arguing about deterministic destruction or how C++ 11 is not the C++ you remember.",
      "Kate runs a small consulting firm in rural Ontario and provides mentoring and management consultant services, as well as writing code every week. She has spoken all over the world, written over a dozen books, and helped thousands of developers to be better at what they do. Kate is a Microsoft Regional Director, and a Visual C++ MVP, an Imagine Cup judge and mentor, and an active contributor to StackOverflow and other StackExchange sites. She develops courses for Pluralsight, primarily on C++ and Visual Studio. In 2014 she was Open Content Chair for CppCon, the largest C++ conference ever held, where she also delivered sessions."
    ],
    "guestHeadshot": "/img/hwpod/kate-gregory.jpg",
    "guestFirstMachineImage": "/img/hwpod/ibm-3227.jpg",
    "guestFirstMachineName": "IBM 3277 Terminal (connected to IBM 370)",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/IBM_3270",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.gregcons.com/kateblog/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/gregcons"
      },
      {
        "name": "Gregory Consulting Limited",
        "link": "http://www.gregcons.com/"
      },
      {
        "name": "Pluralsight Author",
        "link": "http://www.pluralsight.com/training/Authors/Details?handle=kate-gregory"
      },
      {
        "name": "WATFIV Language",
        "link": "http://en.wikipedia.org/wiki/WATFIV"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode42.mp3",
    "publishedDate": "09/29/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/iusUaucXwB8"
  },
  {
    "blurb": [
      "This episode is a bit different than my ordinary episode. Carl Franklin and I both have a passion for music and development and that is what this episode is all about.",
      "Carl and I love to play music together at conferences, though he's clearly more polished than I am with those awesome guitar licks. If you are a musician or are just interested in how Carl got started, this is the episode for you!"
    ],
    "episodeNumber": 41,
    "guestName": "Carl Franklin",
    "guestBio": [
      "Carl Franklin is Executive Vice President of App vNext, a software development firm helping to bring about the Internet of Things revolution. Carl is a 20+ year veteran of the software industry, co-host and founder of .NET Rocks!, the first and most widely listened to podcast for .NET developers, a Microsoft MVP for Kinect for Windows, a Microsoft Regional Director, and Senior Executive of Pwop Studios, a full-service audio and video production/post production studio located in Southeastern Connecticut. Carl has been a leader in the .NET community since 2002, and in the Visual Basic (VB) community before that. In the very early days he wrote for Visual Basic Programmer’s Journal, authoring the Q&A column of that magazine as well as many feature articles for VBPJ and other magazines. He has authored two books for John Wiley & Sons on sockets programming in VB, and in 1994 he helped create the very first web site for VB developers, Carl & Gary's VB Home Page."
    ],
    "guestHeadshot": "/img/hwpod/Carl-Franklin.jpg",
    "guestFirstMachineImage": "/img/hwpod/trs80.jpg",
    "guestFirstMachineName": "TRS-80",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/TRS-80",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://carlfranklin.net/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/carlfranklin"
      },
      {
        "name": ".NET Rocks Podcast",
        "link": "http://www.linkedin.com/in/woodring"
      },
      {
        "name": "App vNext",
        "link": "http://www.appvnext.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode41.mp3",
    "publishedDate": "09/22/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/VNCYNfPCAZc"
  },
  {
    "blurb": [
      "I begged Kathleen to do the show and it took forty episodes to get her to agree. Her story starts with an old NASA computer and continues through the leading edge of software development. Kathleen and I talk about the nature of mentoring and surviving in the world of software development."
    ],
    "episodeNumber": 40,
    "guestName": "Kathleen Dollard",
    "guestBio": [
      "Kathleen Dollard wants to teach you to code better. There’s more to learn about the tools you use every day and the tools you aren’t yet using.  Coding is our passion and debugging is our challenge - you’ll be happier if you do both better. Kathleen’s written dozens of articles, spoken at conferences and user groups around the world, and pushes Microsoft to respond to your real world needs as a long time MVP. Her Open Source project RoslynDom offers alterative access to information in the .NET Compiler Platform, Roslyn with a load/interrogate/mutate/build SyntaxTree model. She has courses in the Pluralsight library and a series of C# 6 webcasts now available for free on WintellectNOW."
    ],
    "guestHeadshot": "/img/hwpod/kathleen-dollard.jpg",
    "guestFirstMachineImage": "/img/hwpod/hp-2100.jpg",
    "guestFirstMachineName": "HP-2116",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/HP_2100",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://blogs.msmvps.com/Kathleen/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/KathleenDollard"
      },
      {
        "name": "Microsoft MVP",
        "link": "http://mvp.microsoft.com/en-us/MVP/Kathleen%20Dollard-6550"
      },
      {
        "name": "Pluralsight Author",
        "link": "http://www.pluralsight.com/training/Authors/Details/kathleen-dollard"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode40.mp3",
    "publishedDate": "09/15/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/voa7pWl-smY"
  },
  {
    "blurb": [
      "If you've been following Silverlight from my old days, I am sure you know the name of Tim Heuer. "
    ],
    "episodeNumber": 39,
    "guestName": "Tim Heuer",
    "guestBio": [
      "Tim Heuer is a program manager for Microsoft working on the client UI developer platforms working on XAML in Windows and previously Silverlight. Before joining the XAML engineering teams, Tim worked with technical communities across the country helping to foster and build user communities focused on software developer technologies. Tim has worked with Microsoft developer tools and technologies since the early 1990s. Prior to joining Microsoft, he worked as a consultant for 14 years helping to implement technology solutions to enable success in businesses across various industries such as health care, construction, real estate, and electronic commerce to name a few. He's inflicted with the unfortunate disease that his work is also his hobby and he loves technology. You can usually find him behind the keyboard trying to learn something new. You can find him online sharing his thoughts on technology at <a href='http://timheuer.com/blog/'>http://timheuer.com/blog/</a>."
    ],
    "guestHeadshot": "/img/hwpod/tim-heuer.jpg",
    "guestFirstMachineImage": "/img/hwpod/compaq-portable.jpg",
    "guestFirstMachineName": "Compaq Portable",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Compaq_Portable",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://timheuer.com/blog/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/timheuer"
      },
      {
        "name": "Life Balance Blogpost",
        "link": "http://timheuer.com/blog/archive/2013/05/03/priorities-passion-employment-work-life-balance.aspx "
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode39.mp3",
    "publishedDate": "09/02/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/dsxI2HHC-_0"
  },
  {
    "blurb": [
      "Stephen Forte is bundle of energy and I love talking with him in any situation. If you've loved his Scrum talks and his views on building businesses, you'll love this episode of the Hello World Podcast.",
      "In this episode, Stephen and I sit down and talk all about enterpreneurship and computer science. We talk about the difference betwen a lifestyle business and a business with an exit strategy. If you're thinking of creating your own startup, this is the episode for you!"
    ],
    "episodeNumber": 38,
    "guestName": "Stephen Forte",
    "guestBio": [
      "Stephen Forte is the Chief Strategy Officer of the venture backed company, Telerik, a leading vendor of developer and team productivity tools. He is the founder and executive director of Mach5, a Silicon Valley based startup accelerator and co-founder of AcceleratorHK, Hong Kong’s first startup accelerator. Involved in several startups, he was the co-founder of Triton Works, which was acquired by UBM (London: UBM.L) in 2010 and was the Chief Technology Officer and co-founder of Corzen, Inc., which was acquired by Wanted Technologies (TXV: WAN) in 2007. Prior to Corzen, Stephen served as the CTO of Zagat Survey in New York City (acquired by Google in 2011) and also was co-founder of the New York-based software consulting firm The Aurora Development Group. Stephen is also a Certified Scrum Master, Certified Scrum Professional, PMP, and also speaks regularly at industry conferences around the world. He has written several books on application and database development. Stephen has an MBA from the City University of New York. Stephen is also a board member of the Scrum Alliance. An avid mountain climber, Stephen leads a trek in the Mt. Everest region every fall to raise money for charity. After several years as an ex-pat in Hong Kong, Stephen now lives in Silicon Valley with his wife."
    ],
    "guestHeadshot": "/img/hwpod/stephen-forte.jpg",
    "guestFirstMachineImage": "/img/hwpod/pc-clone.jpg",
    "guestFirstMachineName": "PC Clone",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Pc_clone",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.stephenforte.net/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/worksonmypc"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode38.mp3",
    "publishedDate": "08/25/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/A1utQPe5fgY"
  },
  {
    "blurb": [
      "Clemens Vasters is well known for his contributions as a Software Architect for Microsoft. As many of you, I've always thought of Clemens as a middleware/back-end guy. On this episode, I find out (to my surprise) that he got started in front-end and graphics for TV systems. See how that turned into the Azure Service Bus and other work he does for Microsoft today."
    ],
    "episodeNumber": 37,
    "guestName": "Clemens Vasters",
    "guestBio": [
      "Clemens Vasters is a Software Architect and currently works for Microsoft where he drives the technical strategy for Microsoft Azure Service Bus and other messaging-centric technologies. Before joining Microsoft, Clemens has worked on financial software solutions and in consulting, has spoken at hundreds of events in over 40 countries, and has contributed to a number of open source efforts including starting the dasBlog blog engine. Clemens has a long history educating developers, having taught some of the first available .NET training courses for developers in Europe in early 2002."
    ],
    "guestHeadshot": "/img/hwpod/Clemens-Vasters.jpg",
    "guestFirstMachineImage": "/img/hwpod/zx81.jpg",
    "guestFirstMachineName": "Sinclair ZX-81",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/ZX81",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://vasters.com/clemensv/"
      },
      {
        "name": "Twitter",
        "link": "http://twitter.com/clemensv"
      },
      {
        "name": "Channel 9 Videos",
        "link": "https://channel9.msdn.com/Events/Speakers/Clemens-Vasters"
      },
      {
        "name": "Pluralsight Author",
        "link": "http://www.pluralsight.com/training/Authors/Details?handle=clemens-vasters"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode37.mp3",
    "publishedDate": "08/18/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/GCV523Z2a9w"
  },
  {
    "blurb": [
      "Troy Hunt is one of those guys that cares about security so I don't have to. In this week show I get to talk to Tony about how he got started both building and breaking software. We talk about the beginnings of his web development career and how that turned into his passion about security.  I hope you enjoy this episode!"
    ],
    "episodeNumber": 36,
    "guestName": "Troy Hunt",
    "guestBio": [
      "Troy lives in the two worlds of building software and breaking software, predominantly software running on the web. From the very early days of HTML, Troy has been a web-centric guy all the way through to today’s modern devices either talking over HTTP or pushing angle brackets around. Having drifted towards security, he now focusses on helping developers understand how to break their own apps and build up offensive skills that are complemented by teaching secure coding patterns – if you don’t know how to break it, you don’t know how to protect it! Troy is an Aussie Microsoft MVP for Developer Security living in Sydney and writing at troyhunt.com as well as speaking around the world, training and creating Pluralsight courses.",
      "When not building or breaking, Troy’s into snowboarding, lots of tennis and fast cars."
    ],
    "guestHeadshot": "/img/hwpod/troy-hunt.jpg",
    "guestFirstMachineImage": "/img/hwpod/pcclone.jpg",
    "guestFirstMachineName": "PC Clone",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Pc_clone",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.troyhunt.com"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/troyhunt"
      },
      {
        "name": "'Have I been Pwnded'",
        "link": "https://haveibeenpwned.com/"
      },
      {
        "name": "Automated Security Analyser for ASP.NET Websites",
        "link": "https://asafaweb.com/"
      },
      {
        "name": "Pluralsight Author",
        "link": "http://pluralsight.com/training/Authors/Details/troy-hunt"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode36.mp3",
    "publishedDate": "08/11/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/VsiKwbUIevw"
  },
  {
    "blurb": [
      "It's funny how intertwined careers can get. I've known of Mike Woodring for years and work with him as a Pluralsight author. Mike has always had a gentle, clear way of fighting through the morass of technical topics.",
      "During this week's podcast, Mike and I got to talk about growing up as the kid who took all his toys apart and how an internship after his freshmen year made him realize that software was what he was really passionate about."
    ],
    "episodeNumber": 35,
    "guestName": "Mike Woodring",
    "guestBio": [
      "Mike is the VP of Developer Content - Enterprise Software at Pluralsight. A former Microsoft C# MVP and multiple U.S. patent holder, Mike has over 20 years of experience developing high performance software systems and training developers around the world. Mike is co-author of Win32 Multithreaded Programming and Debugging Windows Programs: Strategies, Tools, and Techniques for Visual C++ Programmers."
    ],
    "guestHeadshot": "/img/hwpod/mike-woodring.jpg",
    "guestFirstMachineImage": "/img/hwpod/ti99.jpg",
    "guestFirstMachineName": "TI-99",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Ti-99",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://blog.pluralsight.com/author/mikewoodring"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/mcwoodring"
      },
      {
        "name": "LinkedIn",
        "link": "http://www.linkedin.com/in/woodring"
      },
      {
        "name": "Pluralsight Author",
        "link": "http://www.pluralsight.com/training/Authors/Details?handle=mike-woodring"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode35.mp3",
    "publishedDate": "08/04/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/5xPCg1FhMH4"
  },
  {
    "blurb": [
      "You probably know Dan Wahlin from his Pluralsight videos or countless trainings and conferences he has done. I love the way that he simplifies the complex and talks very with clarity no matter the subject.",
      "In this episode, Dan and I talk about how he ended up in web development instead of being a doctor. I think he made the right decision."
    ],
    "episodeNumber": 34,
    "guestName": "Dan Wahlin",
    "guestBio": [
      "Dan Wahlin founded Wahlin Consulting which provides consulting and training services on Web technologies such as JavaScript, AngularJS, HTML5, Node.js, C#, ASP.NET MVC, Web API, and SharePoint. He’s also a course author on Pluralsight.com and has published several courses covering a range of technologies including the new AngularJS JumpStart course on Udemy.com. Dan speaks at conferences and user groups around the world and has written several books on Web technologies.  Dan blogs at http://weblogs.asp.net/dwahlin, runs the Web Weekly newsletter (a great way to stay up on the latest technologies), and writes columns for various technical magazines. Follow Dan on Twitter @DanWahlin."
    ],
    "guestHeadshot": "/img/hwpod/dan-wahlin.jpg",
    "guestFirstMachineImage": "/img/hwpod/apple2c.jpg",
    "guestFirstMachineName": "Apple IIc",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Apple_IIc",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://weblogs.asp.net/dwahlin"
      },
      {
        "name": "Twitter",
        "link": "http://pluralsight.com/training/Authors/Details/joe-eames"
      },
      {
        "name": "AngularJS Jumpstart Course",
        "link": "http://tinyurl.com/angularjsjumpstart"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode34.mp3",
    "publishedDate": "07/28/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/A1QTEb8ENNs"
  },
  {
    "blurb": [
      "During my recent month in London, I finally got to spend some time chewing the fat with Ian Griffiths. We've been hovering near each other at different companies for sometime. I even helped write an appendix for a book that he co-wrote (with Chris Sells).",
      "So I was delighted to get him on the show and talk about his career path. I won't spoil it, but it does start with a three year-old Ian and punch cards."
    ],
    "episodeNumber": 33,
    "guestName": "Ian Griffiths",
    "guestBio": [
      "Ian is an independent consultant, developer, speaker, and author. He has written books on Windows Presentation Foundation, Windows Forms, and Visual Studio. He lives in London but can often be found on various developer mailing lists and newsgroups, where a popular sport is to see who can get him to write the longest email in reply to the shortest possible question."
    ],
    "guestHeadshot": "/img/hwpod/ian-griffiths.jpg",
    "guestFirstMachineImage": "/img/hwpod/ibm-cardpunch.jpg",
    "guestFirstMachineName": "IBM Card Punch Machine",
    "guestFirstMachineLink": "http://www-03.ibm.com/ibm/history/exhibits/vintage/vintage_4506VV4002.html",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.interact-sw.co.uk/iangblog/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/idg10"
      },
      {
        "name": "Pluralsight Author",
        "link": "http://pluralsight.com/training/Authors/Details/ian-griffiths"
      },
      {
        "name": "Agenda View Windows Phone App",
        "link": "http://windows-phone-agenda.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode33.mp3",
    "publishedDate": "07/21/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/W0Ypt97lBgQ"
  },
  {
    "blurb": [
      "If you've ever had a chance to meet Lino, you know he lights up every room he is in. That's how I've seen him. In this episode, we get to hear from him how he got started and some tips for building a hugely successful consulting company. "
    ],
    "episodeNumber": 32,
    "guestName": "Lino Tadros",
    "guestBio": [
      "Alain \"Lino\" Tadros is President & CEO of Falafel Software, a Silicon Valley based company, with presence in Colorado,Texas, Michigan, Florida and North Carolina, dedicated to providing world-class consulting, training, and software development for small, medium, and enterprise level businesses. Prior to founding Falafel, Lino was a member of the development team at Borland for Delphi and C++Builder. Lino has been awarded Microsoft MVP status twelve years in a row for his numerous contributions to the C# community and is an expert in .NET, LINQ, ASP.NET, MVC, XAML, Windows Phone and Web Services. Lino is an industry renowned speaker and has given numerous presentations on 5 different continents since 1994. He also currently sits on the Board of Directors of 4 Silicon Valley corporations."
    ],
    "guestHeadshot": "/img/hwpod/lino-tadros.jpg",
    "guestFirstMachineImage": "/img/hwpod/zx-spectrum-128.jpg",
    "guestFirstMachineName": "Sinclair ZX Spectrum 128",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/ZX_Spectrum#ZX_Spectrum_128",
    "guestLinks": [
      {
        "name": "Falafel Software",
        "link": "http://www.falafel.com"
      },
      {
        "name": "Falafel Software Dubai",
        "link": "http://www.falafelsoft.ae"
      },
      {
        "name": "EventBoard Mobile App",
        "link": "http://www.eventboardmobile.com/"
      },
      {
        "name": "Twitter",
        "link": "http://twitter.com/linotadros"
      },
      {
        "name": "Twitter",
        "link": "http://blog.falafel.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode32.mp3",
    "publishedDate": "07/14/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/yGr4zmO9c6Q"
  },
  {
    "blurb": [
      "I met Joe because of his great work at Pluralsight. We seem to be thinking about the same topics these days. I wanted to hear his story of how he got started. I didn't expect to hear about learning C++ without the benefit of a computer. I think you'll enjoy this one."
    ],
    "episodeNumber": 31,
    "guestName": "Joe Eames",
    "guestBio": [
      "Joe is a front end web developer, consultant and freelance author for Pluralsight. Joe has always has worked both full and part time as a technical teacher for over ten years. He is a frequent blogger and speaker, organizer of ng-conf, the AngularJS conference (www.ng-conf.org), and a panelist on the JavaScript Jabber podcast (http://javascriptjabber.com/)"
    ],
    "guestHeadshot": "/img/hwpod/joe-eames.jpg",
    "guestFirstMachineImage": "/img/hwpod/apple3.jpg",
    "guestFirstMachineName": "Apple III",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Apple_III",
    "guestLinks": [
      {
        "name": "Pluralsight Author",
        "link": "http://pluralsight.com/training/Authors/Details/joe-eames"
      },
      {
        "name": "Twitter",
        "link": "http://twitter.com/josepheames"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode31.mp3",
    "publishedDate": "07/07/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/30ScV3jthu4"
  },
  {
    "blurb": [
      "While Ted and I were at DevelopMentor at the same time, it wasn't until an MVP summit many years ago that I finally got to hang out with him. I've always loved how he skated the thin line of being in the Java and .NET worlds without seeming to prefer either technology.",
      "We got to talk about not only how he got started but where his love of teaching comes from as well as the different career paths of technical and management. I am really excited about this episode and can barely believe that it's been 30 episodes already!"
    ],
    "episodeNumber": 30,
    "guestName": "Ted Neward",
    "guestBio": [
      "Ted is currently the CTO of iTrellis, a team of experienced technology professionals who promote the Continuous Delivery of high quality new services. He is an authority in Java and .NET technologies, particularly in the areas of Java/.NET integration (both in-process and via integration tools like Web services), back-end enterprise software systems, and virtual machine/execution engine plumbing.",
      "He is the author or co-author of several books, including Professional F# 2.0, Effective Enterprise Java, C# In a Nutshell, SSCLI Essentials, Server-Based Java Programming, and a contributor to several technology journals. Ted is also a Microsoft F# MVP, BEA Technical Director, INETA speaker, former DevelopMentor instructor, frequent worldwide conference speaker, and a member of various Java JSRs. He lives in the Pacific Northwest with his wife, two sons, and eight PCs. "
    ],
    "guestHeadshot": "/img/hwpod/ted-neward.jpg",
    "guestFirstMachineImage": "/img/hwpod/apple2plus.jpg",
    "guestFirstMachineName": "Apple II+",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Apple_II_Plus",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://blogs.tedneward.com/"
      },
      {
        "name": "Twitter",
        "link": "http://twitter.com/tedneward"
      },
      {
        "name": "iTrellis",
        "link": "http://www.itrellis.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode30.mp3",
    "publishedDate": "06/23/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/RzHSaJGO0dg"
  },
  {
    "blurb": [
      "I met Rob back a bunch of years ago at DevTeach in Vancouver, BC and we were traveling in the same technology circles. Even though Rob insists on loving Visual Basic, I still consider him a friend.",
      "In this episode, I talk with Rob about how important community involvement is to him career and how he encourages the next round of great developers with his community activism."
    ],
    "episodeNumber": 29,
    "guestName": "Rob Windsor",
    "guestBio": [
      "Rob Windsor is a Lead SharePoint Consultant with Portal Solutions - a Microsoft Gold Partner based in DC and Boston. He has twenty years experience developing rich-client and web applications with various languages and is currently spending a majority of his time working with SharePoint. Rob is a regular speaker at conferences and community events and he authors content for the Pluralsight On-Demand library. Rob is the founder and past-president of the North Toronto .NET User Group and has been recognized as a Microsoft Most Valuable Professional for his involvement in the developer community."
    ],
    "guestHeadshot": "/img/hwpod/rob-windsor.jpg",
    "guestFirstMachineImage": "/img/hwpod/digital-vax.jpg",
    "guestFirstMachineName": "Digital VAX Machine",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/VAX",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.msmvps.com/blogs/windsor"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode29.mp3",
    "publishedDate": "06/16/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/EMFflRqBXC4"
  },
  {
    "blurb": [
      "As a veteran of both the world of being an independent software developer and a cog in a machine like Microsoft, Rachel Appel has a great perspective of being a dev in today's world. Rachel and I run into each other at conferences all over the world and I can always count on her for honesty and frankness.",
      "In this episode we talk about how she grew up in a small town and became a software developer. She talks about her shift of focus over the years from developer, consultant and evangelist. Take a listen:"
    ],
    "episodeNumber": 28,
    "guestName": "Rachel Appel",
    "guestBio": [
      "Rachel is a 20+ year consultant, author, mentor, and former Microsoft employee in the IT industry who speaks at top industry conferences such as VSLive!, DevConnections, MIX, and more. During her career, Rachel has worked on projects of all sizes from the smallest of apps to the largest enterprise systems at some of the world’s leading companies."
    ],
    "guestHeadshot": "/img/hwpod/rachel-appel.jpg",
    "guestFirstMachineImage": "/img/hwpod/apple2e.jpg",
    "guestFirstMachineName": "Apple ][e",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Apple_IIe",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://rachelappel.com/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/rachelappel"
      },
      {
        "name": "MSDN Magazine Column",
        "link": "http://msdn.microsoft.com/en-us/magazine/ee532098.aspx?sdmr=RachelAppel&sdmi=authors"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode28.mp3",
    "publishedDate": "06/09/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/_G2Ze73mJf8"
  },
  {
    "blurb": [
      "Back when I was doing mostly C++, I felt specificly indebted to the great work that John Robbins did both at Numega and his great books on debugging. As .NET became my development world, his insights continued to shape the developer I am today.",
      "In this episode I talk with John about how being a Green Beret informed how he does software development. We also talk about being a twenty-five year old freshman in college and his late start to computing."
    ],
    "episodeNumber": 27,
    "guestName": "John Robbins",
    "guestBio": [
      "John is a co-founder of Wintellect (http://www.wintellect) and a course author at WintellectNOW (http://www.wintellectnow.com). In our business it’s good to specialize in something so John specializes in pain: debugging and performance tuning. He’s debugged and tuned applications for companies such as eBay, Microsoft, AutoDesk, and everyone in between. As a 10 year MVP, John’s written countless articles and three books on debugging. Prior to starting Wintellect 14 years ago John was one of the earliest developers at the legendary debugging tools company, NuMega. He got a late start as a software developer after having spent five years as a paratrooper and Green Beret in the US Army."
    ],
    "guestHeadshot": "/img/hwpod/john-robbins.jpg",
    "guestFirstMachineImage": "/img/hwpod/z-183.jpg",
    "guestFirstMachineName": "Zenith Z-183",
    "guestFirstMachineLink": "http://www.computinghistory.org.uk/det/24719/Zenith-Laptop-Computer-ZWL-183-92/",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.wintellect.com/Blogs"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/JohnWintellect"
      },
      {
        "name": "Wintellect",
        "link": "http://www.wintellect.com"
      },
      {
        "name": "WintellectNOW (with free two week promo code)",
        "link": "https://www.wintellectnow.com/Account/Promo/JOHNR-2013"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode27.mp3",
    "publishedDate": "06/02/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": ""
  },
  {
    "blurb": [
      "I've spent a lot of time creating XAML and MVVM models. Without Laurent Bugnion's great MVVM Library, I would have been stuck. I've admired his attitude and generosity for quite some time.",
      "In this episode of the Hello World Podcast I get to talk to Laurent about how he got started, how he works with UX people and how he got diverted from his first love of flying."
    ],
    "episodeNumber": 26,
    "guestName": "Laurent Bugnion",
    "guestBio": [
      "Laurent works as Senior Director for IdentityMine, one of the leading companies (and Gold Partner) for Microsoft technologies such as Windows Presentation Foundation, Silverlight, Pixelsense, Windows 8, Windows Phone, XBOX and generally User Experience. He is based in Zurich Switzerland, where he lives with his wife Chi Meei and his two daughters Alise and Laeticia.",
      "In October 2010, the book 'Silverlight 4 Unleashed' that he wrote was published at Sams, an advanced sequel to 'Silverlight 2 Unleashed' (published Oct 2008). He writes for MSDN magazine and other publications, codes in Windows Phone, Windows 8, WPF, Silverlight, ASP.NET and his blog is on http://blog.galasoft.ch. 2014 is his 8th year as a Microsoft Most Valuable Professional (Client Dev) and his second year as a Microsoft Regional Director. He is also the author of the well-known open source framework MVVM Light for Windows Phone, Windows 8, WPF, Silverlight."
    ],
    "guestHeadshot": "/img/hwpod/laurent-bugnion.jpg",
    "guestFirstMachineImage": "/img/hwpod/mac-lc-ii.jpg",
    "guestFirstMachineName": "Macintosh LC II",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Macintosh_LC",
    "guestLinks": [
      {
        "name": "Galasoft",
        "link": "http://www.galasoft.ch"
      },
      {
        "name": "Blog",
        "link": "http://blog.galasoft.ch"
      },
      {
        "name": "MVVM Light",
        "link": "http://www.mvvmlight.net"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode26.mp3",
    "publishedDate": "05/26/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": ""
  },
  {
    "blurb": [
      "Jon and I have known each other for a long time and we've had some of the most interesting conversations I can remember, mostly over an adult beverage or two. In this episode, I talk with Jon about his start and how lawyers might make the best developers. "
    ],
    "episodeNumber": 25,
    "guestName": "Jon Flanders",
    "guestBio": [
      "Jon is most at home spelunking, trying to figure out how things work from the inside out. Jon is the author of RESTful.NET from O'Reilly, as well as Essential ASP for Addison-Wesley, and was a co-author of Mastering Visual Studio.NET for O'Reilly. Jon is currently helping companies build applications for the iPhone and iPad using iOS."
    ],
    "guestHeadshot": "/img/hwpod/jon-flanders.jpg",
    "guestFirstMachineImage": "/img/hwpod/vic20.jpg",
    "guestFirstMachineName": "Commodore Vic-20",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Commodore_VIC20",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.jonflanders.com/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/jonflanders"
      },
      {
        "name": "Pluralsight Courses",
        "link": "http://pluralsight.com/training/Authors/Details/jon-flanders"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode25.mp3",
    "publishedDate": "05/20/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://www.youtube.com/watch?v=sKLDoUEpx18"
  },
  {
    "blurb": [
      "As a former DevelopMentor employee and now a Pluralsight author, I of course know Fritz Onion. But to my surprise there was a lot I didn't know about him.",
      "In this episode, we talk about the nature of wanting to teach, early multi-processor OSs that he helped build in grad school, as well as why acoustic guitars are awesome. Take a listen!"
    ],
    "episodeNumber": 24,
    "guestName": "Fritz Onion",
    "guestBio": [
      "Fritz is a co-founder of Pluralsight where he serves as the Chief Content Officer.",
      "Fritz is the author of the book 'Essential ASP.NET' published by Addison Wesley, available in both C# and Visual Basic .NET editions, and 'Essential ASP.NET 2.0'. He is a past columnist for MSDN Magazine, and and has spoken at many industry conferences including the PDC, TechEd, and VSLive!. Prior to .NET, Fritz's work focused on Windows development with C++ and COM, and has written several courses and many articles on C++, MFC, COM, and ATL. Microsoft recognized Fritz as an MVP for over 5 years for his contributions to the ASP.NET community.",
      "Fritz lives in central Maine."
    ],
    "guestHeadshot": "/img/hwpod/fritz-onion.jpg",
    "guestFirstMachineImage": "/img/hwpod/mac-128k.jpg",
    "guestFirstMachineName": "Macintosh (128K)",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Macintosh_128K",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://blog.pluralsight.com/author/fritzonion"
      },
      {
        "name": "Pluralsight",
        "link": "http://pluralsight.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode24.mp3",
    "publishedDate": "05/12/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/NXDLHPw0sHU"
  },
  {
    "blurb": [
      "This week I had Phil Haack on the show to talk about how he got started. As you probably already know, he was formerly on the ASP.NET team doing great work with MVC and other projects.",
      "I was able to ask him all the hard questions including when he changed his name to improve his stature in the development community. We also talked about his Coco computer, F# and how he's ended up doing desktop development at GitHub."
    ],
    "episodeNumber": 23,
    "guestName": "Phil Haack",
    "guestBio": [
      "Phil Haack (yes, it's pronounced \"hack\") works at GitHub finding ways to make it better for .NET and Windows developers everywhere. Prior to GitHub, he was a senior Program Manager at Microsoft responsible for shipping ASP.NET MVC, NuGet, among other projects. These projects were released under open source licenses and helped served as examples of the open source model for shipping software to other teams at Microsoft.",
      "Phil is a co-author of the popular Professional ASP.NET MVC series and regularly speaks at conferences around the world. He's also made several appearances on technology podcasts such as .NET Rocks, Hanselminutes, Herding Code, and The Official jQuery Podcast."
    ],
    "guestHeadshot": "/img/hwpod/phil-haack.jpg",
    "guestFirstMachineImage": "/img/hwpod/trs80coco.jpg",
    "guestFirstMachineName": "TRS-80 Color Computer",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/TRS-80_Color_Computer",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://haacked.com/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/haacked"
      },
      {
        "name": "GitHub",
        "link": "https://github.com/haacked"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode23.mp3",
    "publishedDate": "05/05/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/9B6t89MnemQ"
  },
  {
    "blurb": [
      "As a critical member of the ASP.NET team, I have always admired Brad Wilson's mix of pragmatism and humility. I was thrilled to find out he agreed to be on the podcast.",
      " In this week's episode we chat about early Commodore machines, what it is like to struggle to find the next job and the look our partner's have given us when we're playing MMOs. I think you'll really appreciate this one!"
    ],
    "episodeNumber": 22,
    "guestName": "Brad Wilson",
    "guestBio": [
      "Brad Wilson has been a software professional for more than 20 years, working as a consultant, developer, team lead, architect, and CTO. He is probably best known for his work on ASP.NET MVC and ASP.NET Web API during his 7 1/2 year tenure at Microsoft. Today, he calls CenturyLink Cloud his home, where he is a Technical Director working on their worldwide Infrastructure-as-a-Service and cloud management platform. He also is an active open source contributor to xUnit.net and ElasticLINQ.",
      "In his off hours, he's an avid musician, poker player, and photographer."
    ],
    "guestHeadshot": "/img/hwpod/brad-wilson.jpg",
    "guestFirstMachineImage": "/img/hwpod/commodore-pet.jpg",
    "guestFirstMachineName": "Commodore PET",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Commodore_PET",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "https://twitter.com/bradwilson"
      },
      {
        "name": "Blog",
        "link": "http://bradwilson.typepad.com/"
      },
      {
        "name": "Century Link Cloud",
        "link": "http://www.centurylinkcloud.com/"
      },
      {
        "name": "xUnit.net",
        "link": "https://github.com/xunit/xunit"
      },
      {
        "name": "ElasticLINQ",
        "link": "https://github.com/CenturyLinkCloud/ElasticLINQ"
      },
      {
        "name": "500px",
        "link": "http://500px.com/bradwilson"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode22.mp3",
    "publishedDate": "04/28/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/aKIGtzz2n-k"
  },
  {
    "blurb": [
      "This week I'm interviewing the interviewer! I had the pleasure of getting to chat with Richard Campbell about how he got started and it's an interesting story about fulfilling customer needs instead of focusing on the cool-ness of the technology. I think you're really like this converstaion."
    ],
    "episodeNumber": 21,
    "guestName": "Richard Campbell",
    "guestBio": [
      "Richard Campbell has more than 30 years of high-tech experience and is both a Microsoft Regional Director and Microsoft Most Valuable Professional (MVP). He has consulted with a number of leading North American organizations; Barnes&Noble.com, Dow Chemical, Johnson & Johnson Health Care Services, Reuters, Subaru/Isuzu and the U.S. Air Force.",
      "In addition to speaking at conferences around the world, Richard is co-host of '.NET Rocks!, the Internet Audio Talk Show for .NET Developers' and the host of 'RunAs Radio, the Internet Audio Talk Show for IT Professionals'."
    ],
    "guestHeadshot": "/img/hwpod/richard-campbell.jpg",
    "guestFirstMachineImage": "/img/hwpod/trs80-m1.jpg",
    "guestFirstMachineName": "TRS-80 Model 1",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/TRS-80",
    "guestLinks": [
      {
        "name": ".NET Rocks Podcast",
        "link": "http://www.dotnetrocks.com/"
      },
      {
        "name": "RunAs Radio",
        "link": "http://www.runasradio.com/"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/richcampbell"
      },
      {
        "name": "Humanitarian Toolbox",
        "link": "http://www.htbox.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode021.mp3",
    "publishedDate": "04/21/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/zdAeGd2f21k"
  },
  {
    "blurb": [
      "Scott Meyers wrote some of the most important C++ books in my library. As I fumbled through learning C++, his \r\n              observations on C++ helped shape my career and open many doors for me. I really enjoyed talking with Scott\r\n              about how he got started, both in programming and with C++ to begin with. We even had a chance to talk about\r\n              writing books and how we both enjoy that process."
    ],
    "episodeNumber": 20,
    "guestName": "Scott Meyers",
    "guestBio": [
      "Scott Meyers is one of the world's foremost authorities on C++.  He wrote the best-selling Effective C++ series (Effective C++, More Effective C++, and Effective STL); published and maintains the annotated training materials Overview of the New C++ (C++11/14) and Effective C++ in an Embedded Environment; is Consulting Editor for Addison Wesley's Effective Software Development Series, and, with Herb Sutter and Andrei Alexandrescu, is a principal in the conference-like event, C++ and Beyond. He has a Ph.D in Computer Science from Brown University.",
      "Scott is currently working on a new book, Effective Modern C++: 40 Specific Ways to Improve Your Use of C++11 and C++14, which he desperately hopes to finish by summer."
    ],
    "guestHeadshot": "/img/hwpod/scott-meyers.jpg",
    "guestFirstMachineImage": "/img/hwpod/teletype.jpg",
    "guestFirstMachineName": "Teletype Printer",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Teleprinter",
    "guestLinks": [
      {
        "name": "Website",
        "link": "http://aristeia.com/"
      },
      {
        "name": "Blog",
        "link": "http://scottmeyers.blogspot.com/"
      },
      {
        "name": "His Books",
        "link": "http://www.aristeia.com/books.html"
      },
      {
        "name": "C++ and Beyond",
        "link": "http://cppandbeyond.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode20.mp3",
    "publishedDate": "04/14/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://www.youtube.com/watch?v=RZtFbDwJ0xc"
  },
  {
    "blurb": [
      "As an old ADO guy, my view of how databases were accessed was impacted by Bill Vaughn in a great way. When he agreed to be on the Podcast, I was delighted.",
      "In this episode we talk about his early days transitioning from Army helicopter pilot to working with a litany of groundbreaking companies including his time at Microsoft."
    ],
    "episodeNumber": 19,
    "guestName": "William Vaughn",
    "guestBio": [
      "William R. Vaughn is the former principal of Beta V Corporation and Microsoft MVP who worked at Microsoft for fourteen years. His previous books include seven editions of the popular Hitchhiker's Guides (Microsoft Press, Addison Wesley), ADO Examples and Best Practices, and the bestseller ADO.NET Examples and Best Practices and a separate edition for C# Programmers (APress). Bill is a top-rated speaker at conferences worldwide, including VBits, Developer Connections and TechEd, and is the author of numerous articles for SQL Server Magazine, MSDN Online, and others. He’s currently lecturing for Progressive Business Technology doing online webinars on SQL Server Reporting Services."
    ],
    "guestHeadshot": "/img/hwpod/bill-vaughn.jpg",
    "guestFirstMachineImage": "/img/hwpod/spectra-7046.jpg",
    "guestFirstMachineName": "RCA Spectra 70 Model 46",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/RCA_Spectra_70#Model_70.2F46",
    "guestLinks": [
      {
        "name": "Tech Blog",
        "link": "http://betav.com/blog/billva"
      },
      {
        "name": "Fiction Blog",
        "link": "http://betav.com/blog/fiction/"
      },
      {
        "name": "Company",
        "link": "http://betav.com"
      },
      {
        "name": "Books",
        "link": "http://theowlwrangler.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode19.mp3",
    "publishedDate": "04/07/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "http://youtu.be/VV6Ik9FoXpI"
  },
  {
    "blurb": [
      "I ran into Lynn Langit at last year's Pluralsight Author Summit and had a good conversation about Big Data. When I started the Podcast, I knew she was someone I wanted to have on.",
      "Lynn's story is not typical and involves retail stores, project management and a dose of ADD. I think you'll enjoy this one!"
    ],
    "episodeNumber": 18,
    "guestName": "Lynn Langit",
    "guestBio": [
      "Lynn is the Founder of Lynn Langit Consulting.  There she has been designing and helping teams to implement Big Data solutions.  These solutions have included SQL Server 2012, Hadoop, MongoDB, AWS, Windows Azure and Google Cloud technologies.",
      "In 2013 she was awarded the MVP for SQL Server from Microsoft.  In 2012, 2013 and again in 2014 she was recognized by Google for her community education work around their commercial cloud and received the Google Developer Expert award for the Google Cloud. She is the author of 3 books on SQL Server Business Intelligence (OLAP) the most recent of which is 'Smart Business Intelligence with SQL Server 2008' from MS Press. Lynn is also the author of many articles on BigData Technologies."
    ],
    "guestHeadshot": "/img/hwpod/lynn-langit.jpg",
    "guestFirstMachineImage": "/img/hwpod/compaq-3.jpg",
    "guestFirstMachineName": "Compaq III",
    "guestFirstMachineLink": "http://www.pcmuseum.ca/details.asp?id=50",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.lynnlangit.com"
      },
      {
        "name": "YouTube Channel",
        "link": "http://www.youtube.com/SoCalDevGal"
      },
      {
        "name": "Teaching Kids Programming",
        "link": "http://www.TeachingKidsProgramming.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode018.mp3",
    "publishedDate": "03/31/14",
    "status": 1,
    "length": "00:47:00",
    "youTubeLink": "https://www.youtube.com/watch?v=_xO5h50kApo"
  },
  {
    "blurb": [
      "Jim Wilson and I have had a lot of discussions about Android and Windows Phone. Discussions may be charitable. I love his sense of wonder and pragmatism. As a lover of mobile devices, Jim really understands what is important. Even back when we were both at DevelopMentor, it was clear to me that Jim had a lot of passion for software development. It's great to hear how it all got started.",
      "While we don't go at it over mobile platforms any more, it was nice to catch up with him at the recent Pluralsight Author Summit and talk about how he got started. You might be surprised how metal-shop and TRS-80's both contributed to his beginings."
    ],
    "episodeNumber": 17,
    "guestName": "Jim Wilson",
    "guestBio": [
      "Jim Wilson is president of JW Hedgehog, Inc., a consulting firm specializing in solutions for the Android, iOS, and Microsoft platforms. Jim has nearly 30 years of software engineering experience with the past 12 years heavily focused on creating mobile device and location-based solutions. After nearly a decade as a Microsoft Device Application Development MVP, Jim now focuses on developing Android and iOS device applications. Jim has authored over 30 articles on device application development, and has developed mobility and smart client curriculums for several organizations. Although based in New Hampshire, Jim and his wife spend as much time as possible at their place in Celebration, Florida (just 3 miles from Walt Disney World). Checkout Jim’s blog where he talks about a variety of mobile development issues as well as the fun of life just 3 miles from the Home of The Mouse."
    ],
    "guestHeadshot": "/img/hwpod/jim-wilson.jpg",
    "guestFirstMachineImage": "/img/hwpod/trs80.jpg",
    "guestFirstMachineName": "TRS-80",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/TRS-80",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://blog.jwhh.com"
      },
      {
        "name": "Twitter",
        "link": "http://twitter.com/hedgehogjim"
      },
      {
        "name": "Company",
        "link": "http://www.jwhedgehog.com/"
      },
      {
        "name": "Pluralsight Courses",
        "link": "http://pluralsight.com/training/Authors/Details/jim-wilson"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode17.mp3",
    "publishedDate": "03/24/14",
    "status": 1,
    "length": "00:00:00",
    "youTubeLink": "https://www.youtube.com/watch?v=PadqczzbJmA"
  },
  {
    "blurb": [
      "Like this week's guest, I have a passion for the Windows Phone. We don't agree on everything, but who could with a Dane who lives in Australia? Lars is a fellow Pluralsight author so I caught up with him at the recent Pluralsight Author Summit in Utah. Take a listen and see what you think."
    ],
    "episodeNumber": 16,
    "guestName": "Lars Klint",
    "guestBio": [
      "Lars Klint suffers from split personality, as some would say. On the one hand he is a passionate programmer using the Microsoft Stack through .Net and C#. On the other hand he is a mad car guy. Lars loves to get his hands dirty and maintain his fleet of classic and off-road cars. When he is not in front of a phone, laptop, desktop or other gadget, he is out in the bush getting muddy or on a car club cruise. Lars has so far published two courses with Pluralsight: Building Windows Phone Apps that Stand Out and Windows Phone Testing and Error Management. As a frequent blogger, Lars has contributed articles to the Kiandra IT Blog, Nokia’s DVLUP portal and his own blog at klint.co, often presenting arguments that are not quite main stream, but with a dash of humour and a smidgen of cheekiness. If you want to ask Lars questions, suggest blog ideas, sell a car etc., shoot him an email or follow@larsklint on twitter."
    ],
    "guestHeadshot": "/img/hwpod/lars-klint.jpg",
    "guestFirstMachineImage": "/img/hwpod/c64.jpg",
    "guestFirstMachineName": "Commodore 64",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/commodore_64",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://klint.co"
      },
      {
        "name": "Pluralsight courses",
        "link": "http://pluralsight.com/training/Authors/Details/lars-klint"
      },
      {
        "name": "Pluralsight Blog articles",
        "link": "http://blog.pluralsight.com/author/lars-klint"
      },
      {
        "name": "Twitter page",
        "link": "https://twitter.com/larsklint"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode16.mp3",
    "publishedDate": "03/17/14",
    "status": 1,
    "length": "00:34:00",
    "youTubeLink": "https://www.youtube.com/watch?v=VmwzVkWMxR4"
  },
  {
    "blurb": [
      "You may know John Papa from Silverlight TV or his excellent Pluralsight courses. I've known John for many years. We seem to travel in the same circles technologically. He was one of the first calls I made when I started the podcast. ",
      "I finally was able to corral him at the Pluralsight Author Summit. I was surprised that he was the first of my guests to start off with a Commodore (like I did). He also had some very interesting comments about motivation and mentoring that I think most of us will share. Have a listen!"
    ],
    "episodeNumber": 15,
    "guestName": "John Papa",
    "guestBio": [
      "John Papa is a well-known technology expert and is a former Evangelist for Microsoft on the Silverlight, Windows Phone and Windows 8 client teams. John is a Microsoft Regional Director and author of 100+ articles and 10 books, specializes in professional application development with technologies including HTML5, JavaScript, CSS, Angular, Durandal, Silverlight, WPF, C#, and .NET. He can often be found speaking around the world at keynotes and sessions for conferences such as Build, MIX, PDC, TechEd, VSLive and AngleBrackets. John was the host of the popular show Silverlight TV on Channel 9 and hosted many events including the MIXer and Open Source Fest at major conferences. He currently enjoys authoring courses for Pluralsight. You can always find John at johnpapa.net or on twitter at @john_papa."
    ],
    "guestHeadshot": "/img/hwpod/john-papa.jpg",
    "guestFirstMachineImage": "/img/hwpod/c64.jpg",
    "guestFirstMachineName": "Commodore 64",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/commodore_64",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://www.johnpapa.net/"
      },
      {
        "name": "Pluralsight Videos",
        "link": "http://pluralsight.com/training/Authors/Details/john-papa"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode15.mp3",
    "publishedDate": "03/10/14",
    "status": 1,
    "length": "00:38:00",
    "youTubeLink": "https://www.youtube.com/watch?v=63-Q16MBNvo"
  },
  {
    "blurb": [
      "Julie Lerman and I have known each other for long enough that neither of us is comfortable with how old that makes us feel. That's what makes this episode special. Julie and I take her back to her early years with computers and what it is like being an independent software developer for over 25 years. We chat about how being a woman in technology has affected her (or in many cases, not affected her).",
      "I hope you enjoy the episode. It was a pleasure to catch up with her!"
    ],
    "episodeNumber": 14,
    "guestName": "Julie Lerman",
    "guestBio": [
      "Julie Lerman is a Microsoft MVP, .NET mentor and consultant who lives in the hills of Vermont. You can find Julie presenting on Entity Framework and other Microsoft .NET topics at user groups and conferences around the world. Julie blogs at thedatafarm.com/blog, is the author of the highly acclaimed 'Programming Entity Framework' books, the MSDN Magazine Data Points column and popular videos on Pluralsight.com. Follow Julie on twitter at julielerman."
    ],
    "guestHeadshot": "/img/hwpod/julie-lerman.jpg",
    "guestFirstMachineImage": "/img/hwpod/hp-41.jpg",
    "guestFirstMachineName": "HP-41",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/HP-41",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://thedatafarm.com/blog/"
      },
      {
        "name": "Pluralsight Videos",
        "link": "http://pluralsight.com/training/Authors/Details/julie-lerman"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode14.mp3",
    "publishedDate": "03/05/14",
    "status": 1,
    "length": "00:38:00",
    "youTubeLink": "https://www.youtube.com/watch?v=SpU5CZafXcc"
  },
  {
    "blurb": [
      "Many of you probably know this week's guest from his large collection of Pluralsight courses or heard his speak at conferences across the globe. I've always enjoyed his gentle manner and humility that lends itself so much to teaching technical content.",
      "In this episode, Scott shares with us about writing software to test chocolate, the complexity of real random numbers and his first experience with MIDI controllers on an Atari ST computer. I hope you enjoy it!"
    ],
    "episodeNumber": 13,
    "guestName": "K. Scott Allen",
    "guestBio": [
      "Scott is a founder and Principal Consultant with OdeToCode LLC and the CTO at Medisolv Inc. He has 20+ years of commercial software development experience across a wide range of technologies. He’s successfully delivered software products for embedded, Windows, and web platforms. He’s also developed web services for Fortune 50 companies and firmware for startups.",
      "Scott is also a Pluralsight author, a host on the podcast Herding Code, written a few books, and spoken at conferences around the world."
    ],
    "guestHeadshot": "/img/hwpod/k-scott-allen.jpg",
    "guestFirstMachineImage": "/img/hwpod/ti99.jpg",
    "guestFirstMachineName": "TI-99",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Ti-99",
    "guestLinks": [
      {
        "name": "His Website",
        "link": "http://odetocode.com/"
      },
      {
        "name": "Twitter",
        "link": "http://twitter.com/OdeToCode"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode13.mp3",
    "publishedDate": "02/24/14",
    "status": 1,
    "length": "00:42:00",
    "youTubeLink": "http://youtu.be/H_TmKV-vZPM"
  },
  {
    "blurb": [
      "Scott Hanselman joins me for the twelfth episode of the Hello World podcast. As many of my listeners, I too follow Scott on twitter and have been using it blog as a valuable resource for some time. I’ve always been impressed by his frankness when it comes to what technologies are valuable and which ones are not.",
      "In this episode we talk about a number of topics including being an A/V geek, what being a kid with a business card was like, and how it felt finishing his college degree."
    ],
    "episodeNumber": 12,
    "guestName": "Scott Hanselman",
    "guestBio": [
      "Scott is a web developer who has been blogging at http://hanselman.com for over a decade. He works in Open Source on ASP.NET and the Azure Cloud for Microsoft out of his home office in Portland, Oregon. Scott has three podcasts, http://hanselminutes.com for tech talk, http://thisdeveloperslife.com on developers' lives and loves, and http://ratchetandthegeek.com for pop culture and tech media. He's written a number of books and spoken in person to almost a half million developers worldwide."
    ],
    "guestHeadshot": "/img/hwpod/scott-hanselman.jpg",
    "guestFirstMachineImage": "/img/hwpod/apple2.jpg",
    "guestFirstMachineName": "Apple II",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Apple_II",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://hanselman.com"
      },
      {
        "name": "Hanselminutes Podcast",
        "link": "http://hanselminutes.com"
      },
      {
        "name": "This Developer's Life Podcast",
        "link": "http://thisdeveloperslife.com"
      },
      {
        "name": "Ratchet and the Geek Podcast",
        "link": "http://ratchetandthegeek.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode12.mp3",
    "publishedDate": "02/17/14",
    "status": 1,
    "length": "00:44:00",
    "youTubeLink": "http://youtu.be/jD_CtJDEPes"
  },
  {
    "blurb": [
      "When I first asked Mary Jo Foley to be on the show, she told me she doesn't code. I wouldn't take no for an answer. The result? Hopefully it's great.",
      "She takes us on a journey of what it takes to be a tech journalist. She talks about the first time she interviewed Bill Gates back when Microsoft employees numbered in the hundreds. I hope you like it!"
    ],
    "episodeNumber": 11,
    "guestName": "Mary Jo Foley",
    "guestBio": [
      "Mary Jo has covered the tech industry for 30 years for a variety of publications and Web sites, and is a frequent guest on radio, TV and podcasts, speaking about all things Microsoft-related. She is the author of Microsoft 2.0: How Microsoft plans to stay relevant in the post-Gates era (John Wiley & Sons, 2008). Her primary blog is at allaboutmicrosoft.com on ZDNet. She also is the cohost of the Windows Weekly podcast on TWiT"
    ],
    "guestHeadshot": "/img/hwpod/mary-jo-foley.jpg",
    "guestFirstMachineImage": "/img/hwpod/generic-cpm.jpg",
    "guestFirstMachineName": "CP/M",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/CP/M",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://allaboutmicrosoft.com"
      },
      {
        "name": "TWiT",
        "link": "http://twit.tv/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode11.mp3",
    "publishedDate": "02/10/14",
    "status": 1,
    "length": "00:35:00",
    "youTubeLink": "http://youtu.be/iSN9t9HucCU"
  },
  {
    "blurb": [
      "This week I get to chat with Michele about San Diego weather, WCF, and loving what we do for a living. I love her passion for the technology and clear-headedness about how careers are often not what we expect they'll be. I think you'll enjoy it too!"
    ],
    "episodeNumber": 10,
    "guestName": "Michele Leroux Bustamante",
    "guestBio": [
      "Michele is a Managing Partner at Solliance, a Microsoft Regional Director and MVP.",
      "With 20 years of experience designing and implementing enterprise systems, Michele has held senior executive positions at several corporations, has assembled software development teams and implemented processes for all aspects of the software development lifecycle, and facilitated many successful large-scale enterprise application deployments. Michele specializes in scalable and secure web application and services architecture, cloud-enabled applications and operations, and identity & access management. Michele is a frequent conference presenter and keynote speaker, has chaired many conferences and events, and has been published regularly in several technology journals. Michele’s books include her best selling book Learning WCF (O’Reilly, 2007/2009)."
    ],
    "guestHeadshot": "/img/hwpod/michele-bustamante.jpg",
    "guestFirstMachineImage": "/img/hwpod/pcclone.jpg",
    "guestFirstMachineName": "PC Clone",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Pc_clone",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://michelebusta.com"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/michelebusta"
      },
      {
        "name": "Solliance",
        "link": "http://solliance.net"
      },
      {
        "name": "'Women. Tech. Love.' Podcast",
        "link": "http://www.womentechlove.com/"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode10.mp3",
    "publishedDate": "01/27/14",
    "status": 1,
    "length": "00:44:00",
    "youTubeLink": "http://youtu.be/hvD4_10IiD0"
  },
  {
    "blurb": [
      "This week, I had the great fortune to speak to Glenn Block (of MEF, ScriptCS, and Web API fame). I was surprised by his path. I think you'll enjoy hearing how he got started."
    ],
    "episodeNumber": 9,
    "guestName": "Glenn Block",
    "guestBio": [
      "Glenn is a product manager for Splunk's developer experience. In his spare time he is also the author and a maintainer of scriptcs, an OSS tool for C# scripting. A hardcore coder professionally for almost 20 years, he cares deeply about making developers' lives easier.  Previously Glenn worked at Microsoft where he kickstarted ASP.NET Web API and spearheaded Microsoft's node.js story on Azure. Glenn is an active contributor to  Node.js and .NET OSS projects, a supporter of the community, and a frequent speaker internationally on software development. He is also a bit of a Web API fanatic and author of a new OReilly book on the subject. He lives with his wife and daughter in Seattle where rain and caffeine are a plenty."
    ],
    "guestHeadshot": "/img/hwpod/glenn-block.jpg",
    "guestFirstMachineImage": "/img/hwpod/trs80.jpg",
    "guestFirstMachineName": "TRS-80",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/TRS-80",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://codebetter.com/glennblock"
      },
      {
        "name": "Book",
        "link": "http://www.amazon.com/Designing-Evolvable-Web-APIs-ASP-NET/dp/1449337716"
      },
      {
        "name": "ScriptCS",
        "link": "http://scriptcs.net"
      },
      {
        "name": "Radio Shack",
        "link": "http://www.radioshack.com/home/index.jsp"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode9.mp3",
    "publishedDate": "01/21/14",
    "status": 1,
    "length": "00:42:00",
    "youTubeLink": "http://youtu.be/4S4xwcIin1o"
  },
  {
    "blurb": [
      "Is there much more to say than 'Charles Petzold'? As a luminary in software, I am honored to hear \r\n              his story. We talk about writing books, writing in PL/1 and what Windows 1.0 looked like. You're in\r\n              for a treat if you are as indebted to his books on Windows development nearly as much as I am."
    ],
    "episodeNumber": 8,
    "guestName": "Charles Petzold",
    "guestBio": [
      "Charles Petzold has been writing about Windows programming for over a quarter century, and his most recent book, Programming Windows, 6th Edition (Microsoft Press, 2012) takes on Windows 8. He is currently writing the DirectX Factor column for MSDN Magazine.",
      "Petzold is also the author of two unique books that explore the foundations of digital computing: Code: The Hidden Language of Hardware and Software (Microsoft Press, 1999) and The Annotated Turing: A Guided Tour through Alan Turing’s Historic Paper on Computability and the Turing Machine (Wiley, 2008)."
    ],
    "guestHeadshot": "/img/hwpod/charles-petzold.jpg",
    "guestFirstMachineImage": "/img/hwpod/pdp-10.jpg",
    "guestFirstMachineName": "PDP-10",
    "guestFirstMachineLink": "https://en.wikipedia.org/wiki/PDP-10",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://charlespetzold.com"
      },
      {
        "name": "His Electronic Music",
        "link": "http://www.charlespetzold.com/etc/AdventuresInElectronicMusic/"
      },
      {
        "name": "The Annotated Turing",
        "link": "http://www.theannotatedturing.com/"
      },
      {
        "name": "Code: The Hidden Language of Computer Hardware and Software",
        "link": "http://www.charlespetzold.com/code/index.html"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode8.mp3",
    "publishedDate": "01/14/14",
    "status": 1,
    "length": "00:45:44",
    "youTubeLink": "http://youtu.be/TM58YFP57vs"
  },
  {
    "blurb": [
      "As my old foe in the HTML v. Silverlight debate years ago, Hadi Hariri and I have been at odds before.\r\n              But this time we don't argue at all but instead he tells us about how he begged to get \r\n              a CRC-464 as a young boy and ended up writing software for his community center."
    ],
    "episodeNumber": 7,
    "guestName": "Hadi Hariri",
    "guestBio": [
      "Hadi a Software Developer, who currently works at JetBrains. His passions include Web Development and Software Architecture. He’s written a few books and has been speaking at conferences for over a decade, on things he’s passionate about."
    ],
    "guestHeadshot": "/img/hwpod/hadi-hariri.jpg",
    "guestFirstMachineImage": "/img/hwpod/cpc464.jpg",
    "guestFirstMachineName": "Amstrad CPC-464",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Amstrad_CPC",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://hadihariri.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Episode7.mp3",
    "publishedDate": "01/06/14",
    "status": 1,
    "length": "00:47:54",
    "youTubeLink": "http://youtu.be/VZml9S2_ojU"
  },
  {
    "blurb": [
      "Ward Bell, well known for his wardrobe, is a great guest this week on the podcast. We talk about the ideas that\r\n              shaped his early life as a developer. If you don't know what APL is or haven't had the experience to work\r\n              with an IBM 360, this is the episode for you!"
    ],
    "episodeNumber": 6,
    "guestName": "Ward Bell",
    "guestBio": [
      "Ward is a Microsoft MVP and the V.P. of Technology at IdeaBlade (www.ideablade.com), makers of the \"DevForce\" .NET application development product and BreezeJS. Ward often obsesses on client technologies for business applications, data access, and development practices."
    ],
    "guestHeadshot": "/img/hwpod/ward-bell.jpg",
    "guestFirstMachineImage": "/img/hwpod/IBM360Selectric.jpg",
    "guestFirstMachineName": "IBM 360 - via Selectric Typewriter",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/IBM_System/360",
    "guestLinks": [
      {
        "name": "Twitter",
        "link": "http://twitter.com/wardbell"
      },
      {
        "name": "BreezeJS",
        "link": "http://www.breezejs.com"
      },
      {
        "name": "Idea Blade",
        "link": "https://www.ideablade.com/"
      },
      {
        "name": "APL",
        "link": "http://en.wikipedia.org/wiki/APL_programming_language"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/EP006_WardBell.mp3",
    "publishedDate": "12/30/13",
    "status": 1,
    "length": "00:44:00",
    "youTubeLink": "http://youtu.be/bPQ9Sp501os"
  },
  {
    "blurb": [
      ""
    ],
    "episodeNumber": 5,
    "guestName": "Jesse Liberty",
    "guestBio": [
      "Jesse Liberty is a Master Consultant for <a href=\"http://falafel.com/\">Falafel Software</a>, a <a href=\"http://mvp.microsoft.com/en-us/mvp/Jesse%20Liberty-5000326\">Microsoft MVP</a>, a Telerik MVP, an <a href=\"http://www.amazon.com/Jesse-Liberty/e/B000APP6I6/ref=sr_tc_2_0?qid=1359124796&amp;sr=1-2-ent\">author</a>, and he creates courses for <a href=\"http://pluralsight.com/training\">Pluralsight</a>. Jesse hosts the popular <a href=\"http://jesseliberty.com/podcast/\">Yet Another Podcast</a> and his <a href=\"http://jesseliberty.com/\">blog</a> is considered required reading. He was a Senior Evangelist for Microsoft, a XAML Evangelist for Telerik, a Distinguished Software Engineer at AT&T; Software Architect for PBS and Vice President of Information Technology at Citibank. Jesse can be followed on twitter at <a href=\"http://twitter.com/jesseliberty\">@JesseLiberty</a>"
    ],
    "guestHeadshot": "/img/hwpod/jesse-liberty.jpg",
    "guestFirstMachineImage": "/img/hwpod/monrobot.jpg",
    "guestFirstMachineName": "Monrobot",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Monroe_Calculator_Company",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://jesseliberty.com"
      },
      {
        "name": "Yet Another Podcast",
        "link": "http://jesseliberty.com/podcast"
      },
      {
        "name": "Pluralsight Videos",
        "link": "http://pluralsight.com/training/Authors/Details/jesse-liberty"
      },
      {
        "name": "Books",
        "link": "http://www.amazon.com/Jesse-Liberty/e/B000APP6I6/ref=sr_tc_2_0?qid=1379081450&sr=1-2-ent"
      },
      {
        "name": "Felafel Software",
        "link": "http://www.falafel.com/"
      },
      {
        "name": "Twitter",
        "link": "http://www.twitter.com/jesseliberty"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/FullEpisode5.mp3",
    "publishedDate": "12/16/13",
    "status": 1,
    "length": "00:38:24",
    "youTubeLink": "http://youtu.be/sWSl5e_nmzw"
  },
  {
    "blurb": [
      "If you ever expected to hear the phrases 'DirectX' and Air Force in the same sentence,\r\n              you'll enjoy this episode!"
    ],
    "episodeNumber": 4,
    "guestName": "Brian Noyes",
    "guestBio": [
      "Brian Noyes is a software architect, CTO of Solliance (www.solliance.net), Microsoft Regional Director, Microsoft MVP, and Pluralsight Author. Brian specializes in building rich client applications with XAML and HTML 5, as well as the services that back them with Web APIs and WCF Services. Brian has authored a number of books including Developers Guide to Microsoft Prism 4, Smart Client Deployment with ClickOnce, and Data Binding with Windows Forms 2.0, and speaks at conferences worldwide including Microsoft TechEd, VSLive!, DevIntersection, and others. Brian got started programming as a hobby while flying F-14 Tomcats in the U.S. Navy, later turning his passion for software into his current career. You can contact Brian on Twitter @briannoyes or through his blog http://briannoyes.net."
    ],
    "guestHeadshot": "/img/hwpod/brian-noyes.jpg",
    "guestFirstMachineImage": "/img/hwpod/vt100.jpg",
    "guestFirstMachineName": "Mainframe (PDP)",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Programmed_Data_Processor",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://briannoyes.net"
      },
      {
        "name": "Twitter",
        "link": "http://twitter.com/briannoyes"
      },
      {
        "name": "Solliance",
        "link": "http://www.solliance.net"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Final_004.mp3",
    "publishedDate": "12/09/13",
    "status": 1,
    "length": "00:31:22",
    "youTubeLink": "http://youtu.be/_0xPKW67E2k"
  },
  {
    "blurb": [
      "Chris and I are long-time friends and hopefully it shows in this episode, recorded at the \r\n              MVP summit so the echo is an added benefit. If you ever sold a piece of software in a plastic \r\n              bag hung at your local computer shop, you'll enjoy this episode."
    ],
    "episodeNumber": 3,
    "guestName": "Chris Sells",
    "guestBio": [
      "Chris Sells has a long history as a contributing member of the Windows developer community. He enjoys long walks on the beach and various computer technologies."
    ],
    "guestHeadshot": "/img/hwpod/chris-sells.jpg",
    "guestFirstMachineImage": "/img/hwpod/teletype.jpg",
    "guestFirstMachineName": "Teletype Printer",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Teleprinter",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://sellsbrothers.com"
      },
      {
        "name": "Twitter",
        "link": "http://twitter.com/csells"
      },
      {
        "name": "Code Complete Book (Steve McConnel; Book - We had the wrong title)",
        "link": "http://www.amazon.com/Code-Complete-Practical-Handbook-Construction/dp/0735619670"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/E003Final.mp3",
    "publishedDate": "12/02/13",
    "status": 1,
    "length": "00:38:40",
    "youTubeLink": "http://youtu.be/boqToRP5V0U"
  },
  {
    "blurb": [
      "In this episode, Woody and I discuss what's it like starting out late into the development world."
    ],
    "episodeNumber": 2,
    "guestName": "Chris Woodruff",
    "guestBio": [
      "Chris Woodruff (or Woody as he is commonly known as) has a degree in Computer Science from Michigan State University’s College of Engineering. Woody has been developing and architecting software solutions for almost 15 years and has worked in many different platforms and tools. He is a community leader, helping such events as Day of .NET Ann Arbor, West Michigan Day of .NET and CodeMash. He was also instrumental in bringing the popular Give Camp event to Western Michigan where technology professionals lend their time and development expertise to assist local non-profits. As a speaker and podcaster, Woody has spoken and discussed a variety of topics, including database design and open source. He is a Microsoft MVP in Visual C# and was recognized in 2010 as one of the top 20 MVPs world-wide."
    ],
    "guestHeadshot": "/img/hwpod/chris-woodruff.jpg",
    "guestFirstMachineImage": "/img/hwpod/trs80.jpg",
    "guestFirstMachineName": "TRS-80",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/TRS-80",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://chriswoodruff.com"
      },
      {
        "name": "Twitter",
        "link": "http://twitter.com/cwoodruff"
      },
      {
        "name": "Podcast",
        "link": "http://deepfriedbytes.com"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/Final_002.mp3",
    "publishedDate": "11/25/13",
    "status": 1,
    "length": "00:24:00",
    "youTubeLink": "http://youtu.be/ST_d0OcdeZQ"
  },
  {
    "blurb": [
      "In this first episode, I stay local and talk with Atlanta legend Jeremy Likness about how he got started. We discuss the magical TI-99 and how Clipper used to be good!"
    ],
    "episodeNumber": 1,
    "guestName": "Jeremy Likness",
    "guestBio": [
      "Jeremy Likness is a principal consultant at Wintellect. He has 20 years of experience building enterprise applications and specializes in delivering web-based solutions using the Microsoft stack with client technologies like TypeScript and AngularJS. A 4-time Microsoft MVP, Jeremy is the author of several books that cover XAML technologies like Silverlight and Windows 8.1 and speaks frequently at user group events and conferences. Jeremy lives in Woodstock, GA with his wife, daughter, three dogs and an Ecclectus parrot. He loves hiking, running, skiing, shooting guns and shooting pool (9-ball is his favorite game). "
    ],
    "guestHeadshot": "/img/hwpod/jeremy-likness.jpg",
    "guestFirstMachineImage": "/img/hwpod/ti99.jpg",
    "guestFirstMachineName": "TI-99",
    "guestFirstMachineLink": "http://en.wikipedia.org/wiki/Ti-99",
    "guestLinks": [
      {
        "name": "Blog",
        "link": "http://csharperimage.jeremylikness.com/"
      },
      {
        "name": "Twitter",
        "link": "http://twitter.com/jeremylikness"
      },
      {
        "name": "Book",
        "link": "http://bit.ly/winrtexample"
      }
    ],
    "podcastName": "hwpod",
    "audioLink": "http://traffic.libsyn.com/hwpod/EP001-Final.mp3",
    "publishedDate": "11/18/13",
    "status": 1,
    "length": "00:29:57",
    "youTubeLink": "http://youtu.be/lhOhTE9bgbI"
  }
]